[{"w":"abyssal","c":"1","s":"3","d":"adj\t(archaic) Belonging to, or resembling, an abyss; unfathomable. ; adj\t(geography) Of or belonging to the ocean depths, especially below 2000 metres (6500 ft): abyssal zone. ; adj\t(geology) Pertaining to or occurring at excessive depths in the earth\u0027s crust; plutonic. "},{"w":"abhorrent","c":"1","s":"3","d":"adj\t(archaic) Inconsistent with, or far removed from, something; strongly opposed. ; adj\tContrary to something; discordant. ; adj\tAbhorring; detesting; having or showing abhorrence; loathing. ; adj\tDetestable or repugnant. "},{"w":"abated","c":"1","s":"3","d":"adj\t(decorative arts) Lowered, beaten down, or cut away, as the background of an ornamental pattern in relief. Used specifically of stone-cutting; also of metal when the pattern or inscription is to show bright on dark, and the ground is therefore worked out with the graving-tool and left rough or hatched in lines. "},{"w":"ablative","c":"1","s":"3","d":"adj\t(grammar) Applied to one of the cases of the noun in some languages, the fundamental meaning of the case being removal, separation, or taking away, and to a lesser degree, instrument, place, accordance, specifications, price, or measurement. ; adj\t(archaic) Pertaining to taking away or removing. ; adj\t(engineering, nautical, astronautics) Sacrificial, wearing away or being destroyed in order to protect the underlying material, as in ablative paints used for antifouling, or ablative heat shields used to protect spacecraft during reentry. . ; adj\t(medicine) Relating to the removal of a body part, tumor, or organ. ; adj\t(geology) Relating to the erosion of a land mass; relating to the melting or evaporation of a glacier. ; n\t(grammar) The ablative case. ; n\tAn ablative material. "},{"w":"abolitionist","c":"1","s":"5","d":"adj\t(historical) In favor of the abolition of slavery. ; n\tA person who favors the abolition of any particular institution or practice. ; n\t(historical, US) A person who favored or advocated the abolition of slavery. "},{"w":"abovementioned","c":"1","s":"4","d":"adj\t(literary) mentioned above "},{"w":"absent","c":"1","s":"2","d":"adj\t(not comparable) Being away from a place; withdrawn from a place; not present; missing. ; adj\t(not comparable) Not existing; lacking. ; adj\t(comparable) Inattentive to what is passing; absent-minded; preoccupied. ; n\t(with definite article) Something absent, especially absent people collectively; those who were or are not there. ; n\t(obsolete, Scotland) An absentee; a person who is not there. ; v\t(reflexive) To keep (oneself) away. ; v\t(transitive, archaic) To keep (someone) away. ; v\t(intransitive, obsolete) Stay away; withdraw. ; v\t(transitive, rare) Leave. "},{"w":"absents","c":"1","s":"2","d":"adj\t(not comparable) Being away from a place; withdrawn from a place; not present; missing. ; adj\t(not comparable) Not existing; lacking. ; adj\t(comparable) Inattentive to what is passing; absent-minded; preoccupied. ; n\t(with definite article) Something absent, especially absent people collectively; those who were or are not there. ; n\t(obsolete, Scotland) An absentee; a person who is not there. ; v\t(reflexive) To keep (oneself) away. ; v\t(transitive, archaic) To keep (someone) away. ; v\t(intransitive, obsolete) Stay away; withdraw. ; v\t(transitive, rare) Leave. "},{"w":"abysmal","c":"1","s":"3","d":"adj\t(now rare) Pertaining to, or resembling an abyss. ; adj\t(figuratively) extremely bad; terrible. "},{"w":"abrupt","c":"1","s":"2","d":"adj\t(obsolete, rare) Broken away (from restraint). ; adj\tWithout notice to prepare the mind for the event; sudden; hasty; unceremonious. ; adj\tCurt in manner. ; adj\tHaving sudden transitions from one subject or state to another; unconnected; disjointed. ; adj\t(obsolete) Broken off. ; adj\tExtremely steep or craggy as if broken up; precipitous. ; adj\t(botany) Suddenly terminating, as if cut off; truncate. ; v\t(transitive, archaic) To tear off or asunder. ; v\tTo interrupt suddenly. ; n\t(poetic) Something which is abrupt; an abyss. "},{"w":"abducent","c":"1","s":"3","d":"adj\t(obsolete) Drawing away from the median axis of the body, as a muscle; see etymology abducting. ; n\tThat which abducts. ; n\t(neuroanatomy) An abducens nerve. "},{"w":"abortive","c":"1","s":"3","d":"adj\t(obsolete) Produced by abortion; born prematurely and therefore unnatural. ; adj\tComing to nothing; failing in its effect. . ; adj\t(biology) Imperfectly formed or developed; rudimentary; sterile. ; adj\t(pharmacology, medicine, rare, attributive) Causing abortion; abortifacient ; adj\t(medicine) Cutting short; acting to halt or slow the progress (of a disease). ; adj\tMade from the skin of a still-born animal. ; n\t(obsolete) Someone or something born or brought forth prematurely; an abortion. ; n\t(obsolete) A fruitless effort. ; n\t(obsolete) A medicine to which is attributed the property of causing abortion, abortifacient. ; v\t(transitive, obsolete) To cause an abortion; to render without fruit. "},{"w":"abluent","c":"1","s":"3","d":"adj\t(pharmacology) Washing away; carrying off impurities; detergent. ; n\t(pharmacology) A detergent. "},{"w":"abuzz","c":"1","s":"2","d":"adj\t(postpositive) Characterized by a high level of activity or gossip; in a buzz (“feeling or rush of energy or excitement”), buzzing. "},{"w":"abominate","c":"1","s":"4","d":"adj\t(rare) Abominable; detested. ; v\t(transitive) To feel disgust towards; to loathe or detest thoroughly; to hate in the highest degree, as if with religious dread. ; v\t(transitive, colloquial) To dislike strongly. "},{"w":"aboral","c":"1","s":"3","d":"adj\t(zoology) Situated opposite to, or away from, the mouth. "},{"w":"absent-minded","c":"1","s":"4","d":"adj\tAbsent in mind; often preoccupied; forgetful or careless due to distraction; easily distracted. "},{"w":"aboveboard","c":"1","s":"3","d":"adj\tAlternative form of above-board [In open sight; without trick, concealment, or deception.] "},{"w":"absentminded","c":"1","s":"4","d":"adj\tAlternative form of absent-minded [Absent in mind; often preoccupied; forgetful or careless due to distraction; easily distracted.] "},{"w":"aboveground","c":"1","s":"3","d":"adj\tAlternative spelling of above ground "},{"w":"abounding","c":"1","s":"3","d":"adj\tAmple, plenty, abundant. ; n\tAn abundance. "},{"w":"abeyant","c":"1","s":"3","d":"adj\tBeing in a state of abeyance; suspended. "},{"w":"ablaze","c":"1","s":"2","d":"adj\tBurning fiercely; in a blaze; on fire. ; adj\tRadiant with bright light and color. ; adj\tIn a state of glowing excitement, ardent desire, or other strong emotion. ; adv\tOn fire; in a blaze. ; adv\tLit up brightly and with color, gleaming. ; adv\tIn a state of glowing excitement or ardent desire. "},{"w":"abdicated","c":"1","s":"4","d":"adj\tCapable of being abdicated. "},{"w":"abiding","c":"1","s":"3","d":"adj\tContinuing or persisting in the same state: lasting, enduring; steadfast. ; n\tThe action of one who abides; the state of an abider. ; n\t(obsolete) An abode. "},{"w":"absurd","c":"1","s":"2","d":"adj\tContrary to reason or propriety; obviously and flatly opposed to manifest truth; inconsistent with the plain dictates of common sense; logically contradictory; nonsensical; ridiculous; silly. ; adj\t(obsolete) Inharmonious; dissonant. ; adj\tHaving no rational or orderly relationship to people\u0027s lives; meaningless; lacking order or value. ; adj\tDealing with absurdism. ; n\t(obsolete) An absurdity. ; n\t(philosophy, often preceded by the) The opposition between the human search for meaning in life and the inability to find any; the state or condition in which man exists in an irrational universe and his life has no meaning outside of his existence. "},{"w":"abridged","c":"1","s":"2","d":"adj\tCut or shortened, especially of a literary work. "},{"w":"aberrant","c":"1","s":"3","d":"adj\tDiffering from the norm. ; adj\t(sometimes figuratively) Straying from the right way; deviating from morality or truth. ; adj\t(botany, zoology) Deviating from the ordinary or natural type; exceptional; abnormal. ; n\tA person or object that deviates from the rest of a group. ; n\t(biology) A group, individual, or structure that deviates from the usual or natural type, especially with an atypical chromosome number. "},{"w":"abstruse","c":"1","s":"2","d":"adj\tDifficult to comprehend or understand; obscure. ; adj\t(obsolete) Concealed or hidden; secret. "},{"w":"abashed","c":"1","s":"2","d":"adj\tEmbarrassed, disconcerted, or ashamed. "},{"w":"absorbing","c":"1","s":"3","d":"adj\tEngrossing, that sustains someone\u0027s interest. ; adj\t(statistics, of a state) Allowing a process to enter it, but not to leave it. "},{"w":"abject","c":"1","s":"2","d":"adj\tExisting in or sunk to a low condition, position, or state; contemptible, despicable, miserable. ; adj\t(chiefly with a negative connotation) Complete; downright; utter. ; adj\t(rare) Lower than nearby areas; low-lying. ; adj\tOf a person: cast down in hope or spirit; showing utter helplessness, hopelessness, or resignation; also, grovelling; ingratiating; servile. ; n\tA person in the lowest and most despicable condition; an oppressed person; an outcast; also, such people as a class. ; v\tTo cast off or out (someone or something); to reject, especially as contemptible or inferior. ; v\tTo cast down (someone or something); to abase; to debase; to degrade; to lower; also, to forcibly impose obedience or servitude upon (someone); to subjugate. ; v\t(mycology) Of a fungus: to (forcibly) give off (spores or sporidia). "},{"w":"abutting","c":"1","s":"3","d":"adj\tFacing each other, front to front. ; n\tabutment "},{"w":"aboriginal","c":"1","s":"5","d":"adj\tFirst according to historical or scientific records; original; indigenous; primitive. ; adj\tLiving in a land before colonization by the Europeans. ; n\tAn animal or plant native to a region. ; adj\tOf or pertaining to Australian Aboriginal peoples, Aborigines, or their language. ; n\tAn Aboriginal inhabitant of Australia, Aborigine. ; n\tAny of the native languages spoken by Australian aborigines. ; adj\tAlternative letter-case form of Aboriginal [Of or pertaining to Australian Aboriginal peoples, Aborigines, or their language.] ; n\tAlternative letter-case form of Aboriginal [An Aboriginal inhabitant of Australia, Aborigine.] ; adj\tAlternative letter-case form of aboriginal [First according to historical or scientific records; original; indigenous; primitive.] ; n\tAlternative letter-case form of aboriginal [An animal or plant native to a region.] "},{"w":"absolute","c":"1","s":"3","d":"adj\tFree of restrictions, limitations, qualifications or conditions; unconditional. ; adj\tUnrestricted by laws, a constitution, or parliamentary or judicial or other checks; (legally) unlimited in power, especially if despotic. ; adj\tFree from imperfection, perfect, complete; especially, perfectly embodying a quality in its essential characteristics or to its highest degree. ; adj\tPure, free from mixture or adulteration; unmixed. ; adj\tComplete, utter, outright; unmitigated, not qualified or diminished in any way. ; adj\t(very occasionally postpositive) Positive, certain; unquestionable; not in doubt. ; adj\t(archaic) Certain; free from doubt or uncertainty (e.g. a person, opinion or prediction). ; adj\t(especially philosophy) Fundamental, ultimate, intrinsic; not relative; independent of references or relations to other things or standards. ; adj\tHaving reference to or derived in the simplest manner from the fundamental units of mass, time, and length. ; adj\tRelating to the absolute temperature scale (based on absolute zero); kelvin. ; adj\t(of a case form) Syntactically connected to the rest of the sentence in an atypical manner, or not relating to or depending on it, like in the nominative absolute or genitive absolute, accusative absolute or ablative absolute. ; adj\t(of an adjective or possessive pronoun) Lacking a modified substantive, like \"hungry\" in \"feed the hungry\". ; adj\t(of a comparative or superlative) Expressing a relative term without a definite comparison, like \"older\" in \"an older person should be treated with respect\". ; adj\t(of an adjective form) Positive; not graded (not comparative or superlative). ; adj\t(of a usually transitive verb) Having no direct object, like \"kill\" in \"if looks could kill\". ; adj\t(of Celtic languages) Being or pertaining to an inflected verb that is not preceded by any number of particles or compounded with a preverb. ; adj\t(mathematics) As measured using an absolute value. ; adj\t(mathematics) Indicating an expression that is true for all real numbers, or of all values of the variable; unconditional. ; adj\t(education) Pertaining to a grading system based on the knowledge of the individual and not on the comparative knowledge of the group of students. ; adj\t(art, music, dance) Independent of (references to) other arts; expressing things (beauty, ideas, etc) only in one art. ; adj\t(law, postpositive, formal) Indicating that a tenure or estate in land is not conditional or liable to terminate on (strictly) any occurrence or (sometimes contextually) certain kinds of occurrence. ; adj\t(obsolete) Absolved; free. ; n\tThat which exists (or has a certain property, nature, size, etc) independent of references to other standards or external conditions; that which is universally valid; that which is not relative, conditional, qualified or mitigated. ; n\t(geometry) In a plane, the two imaginary circular points at infinity; in space of three dimensions, the imaginary circle at infinity. ; n\t(philosophy, usually capitalized, usually preceded by \"the\") A realm which exists without reference to anything else; that which can be imagined purely by itself; absolute ego. ; n\t(philosophy, usually capitalized, usually preceded by \"the\") The whole of reality; the totality to which everything is reduced; the unity of spirit and nature; God. ; n\t(chemistry) A concentrated natural flower oil, used for perfumes; an alcoholic extract of a concrete. ; n\t(philosophy) That which is totally unconditioned, unrestricted, pure, perfect, or complete; that which can be thought of without relation to others. "},{"w":"absolved","c":"1","s":"2","d":"adj\tfreed from any question of guilt"},{"w":"absorbed","c":"1","s":"2","d":"adj\tFully occupied with one\u0027s thoughts; engrossed. ; adj\tSomething that has been absorbed, taken in, engulfed, imbibed, or assimilated. "},{"w":"abundant","c":"1","s":"3","d":"adj\tFully sufficient; found in copious supply; in great quantity; overflowing. ; adj\tRichly supplied; wealthy; possessing in great quantity. ; adj\t(mathematics) Being an abundant number, i.e. less than the sum of all of its divisors except itself. "},{"w":"abdominous","c":"1","s":"4","d":"adj\tHaving a protuberant belly; potbellied. "},{"w":"abused","c":"1","s":"2","d":"adj\tHaving been a victim of some form of abuse, most commonly child abuse or domestic violence. ; adj\tOverused; used profligately or in excess. ; adj\t(obsolete) Deluded, deceived. "},{"w":"abducted","c":"1","s":"3","d":"adj\tHaving been kidnapped; having become the victim of an abduction "},{"w":"abjured","c":"1","s":"2","d":"adj\tHaving been renounced, forsworn or rejected. "},{"w":"abandoned","c":"1","s":"3","d":"adj\tHaving given oneself up to vice; immoral; extremely wicked, or sinning without restraint; irreclaimably wicked. ; adj\tNo longer maintained by its former owners, residents, or caretakers; forsaken, deserted. ; adj\tFree from constraint; uninhibited. ; adj\t(geology) No longer being acted upon by the geologic forces that formed it. "},{"w":"absorptive","c":"1","s":"3","d":"adj\tHaving power, capacity, or tendency to absorb or imbibe; absorbent. ; n\tAny substance that absorbs. "},{"w":"absorbent","c":"1","s":"3","d":"adj\tHaving the ability or tendency to absorb; able to soak up liquid easily; absorptive. ; n\tAnything which absorbs. ; n\t(physiology, pluralized, now rare) The vessels by which the processes of absorption are carried on, as the lymphatics in animals, the extremities of the roots in plants. ; n\t(medicine) Any substance which absorbs and neutralizes acid fluid in the stomach and bowels, as magnesia, chalk, etc.; also a substance, e.g., iodine, which acts on the absorbent vessels so as to reduce enlarged and indurated parts. ; n\t(chemistry) A liquid used in the process of separating gases or volatile liquids, in oil refining. "},{"w":"able","c":"1","s":"2","d":"adj\tHaving the necessary powers or the needed resources to accomplish a task. ; adj\tFree from constraints preventing completion of task; permitted to; not prevented from. ; adj\tGifted with skill, intelligence, knowledge, or competence. ; adj\t(law) Legally qualified or competent. ; adj\t(nautical) Capable of performing all the requisite duties; as an able seaman. ; adj\t(obsolete, dialectal) Having the physical strength; robust; healthy. ; adj\t(obsolete) Easy to use. ; adj\t(obsolete) Suitable; competent. ; adj\t(obsolete, dialectal) Liable to. ; adj\t(obsolete) Rich; well-to-do. ; v\t(transitive, obsolete) To make ready. ; v\t(transitive, obsolete) To make capable; to enable. ; v\t(transitive, obsolete) To dress. ; v\t(transitive, obsolete) To give power to; to reinforce; to confirm. ; v\t(transitive, obsolete) To vouch for; to guarantee. ; n\t(military) The letter \"A\" in Navy Phonetic Alphabet. ; n\tA surname. "},{"w":"ablest","c":"1","s":"2","d":"adj\tHaving the necessary powers or the needed resources to accomplish a task. ; adj\tFree from constraints preventing completion of task; permitted to; not prevented from. ; adj\tGifted with skill, intelligence, knowledge, or competence. ; adj\t(law) Legally qualified or competent. ; adj\t(nautical) Capable of performing all the requisite duties; as an able seaman. ; adj\t(obsolete, dialectal) Having the physical strength; robust; healthy. ; adj\t(obsolete) Easy to use. ; adj\t(obsolete) Suitable; competent. ; adj\t(obsolete, dialectal) Liable to. ; adj\t(obsolete) Rich; well-to-do. ; v\t(transitive, obsolete) To make ready. ; v\t(transitive, obsolete) To make capable; to enable. ; v\t(transitive, obsolete) To dress. ; v\t(transitive, obsolete) To give power to; to reinforce; to confirm. ; v\t(transitive, obsolete) To vouch for; to guarantee. ; n\t(military) The letter \"A\" in Navy Phonetic Alphabet. ; n\tA surname. "},{"w":"abraded","c":"1","s":"3","d":"adj\thaving the skin scraped off"},{"w":"abased","c":"1","s":"2","d":"adj\tHumbled; lowered, especially in rank, position, or prestige. ; adj\t(heraldry) Borne lower than usual, as a fess; also, having the ends of the wings turned downward towards the point of the shield. "},{"w":"above-mentioned","c":"1","s":"4","d":"adj\tMentioned or named before; aforesaid. "},{"w":"abiotic","c":"1","s":"4","d":"adj\tNonliving, inanimate, characterised by the absence of life; of inorganic matter. ; adj\tTending to inhibit or destroy life; antibiotic; incompatible with life. ; n\tAny such material "},{"w":"abnormal","c":"1","s":"3","d":"adj\tNot conforming to rule or system; deviating from the usual or normal type. ; adj\tOf or pertaining to that which is irregular, in particular, behaviour that deviates from norms of social propriety or accepted standards of mental health. ; n\tA person or object that is not normal. "},{"w":"abdominal","c":"1","s":"4","d":"adj\tOf or pertaining to the abdomen; ventral. ; adj\t(ichthyology) Having the ventral fins under the abdomen and behind the pectoral fins. ; adj\t(ichthyology) Ventral, in describing a fin. ; adj\t(zoology, obsolete) Belonging to the order Abdominales of fish. ; n\t(zoology, obsolete) A fish of the order Abdominales. ; n\t(colloquial, usually plural only) An abdominal muscle. "},{"w":"abrasive","c":"1","s":"3","d":"adj\tProducing abrasion; rough enough to wear away the outer surface. ; adj\tBeing rough and coarse in manner or disposition; overly aggressive and causing irritation. ; n\tA hard inorganic substance or material consisting in powder or granule form such as sandpaper, pumice, or emery, used for cleaning, smoothing, or polishing. ; n\t(geology) Rock fragments, sand grains, mineral particles, used by water, wind, and ice to abrade a land surface. "},{"w":"abusive","c":"1","s":"3","d":"adj\tProne to treat someone badly by coarse, insulting words or other maltreatment; vituperative; reproachful; scurrilous. ; adj\t(obsolete) Tending to deceive; fraudulent. ; adj\t(archaic) Tending to misuse; practising or containing abuse. ; adj\tBeing physically or emotionally injurious; characterized by repeated violence or other abuse. ; adj\tWrongly used; perverted; misapplied; unjust; illegal. ; adj\t(archaic) Catachrestic. "},{"w":"abstemious","c":"1","s":"4","d":"adj\tRefraining from freely consuming food or strong drink; sparing in diet; abstinent, temperate. ; adj\tSparing in the indulgence of the appetite or passions. ; adj\tSparingly used; used with temperance or moderation. ; adj\tMarked by, or spent in, abstinence. ; adj\t(rare) Promotive of abstemiousness. "},{"w":"abstinent","c":"1","s":"3","d":"adj\tRefraining from indulgence, especially from the indulgence of appetite. ; n\tOne who abstains; a faster. ; n\t(usually capitalized, religion, historical) One of a sect who appeared in France and Spain in the 3rd century, and believed in abstinence from meat and sex. ; n\t(religion, historical) One of a religious sect that appeared in France and Spain in the 3rd century, and practised abstinence from meat and sex. "},{"w":"abstracted","c":"1","s":"3","d":"adj\tSeparated or disconnected; withdrawn; removed; apart. ; adj\t(now rare) Separated from matter; abstract; ideal, not concrete. ; adj\t(now rare) Abstract; abstruse; difficult. ; adj\tInattentive to surrounding objects; absent in mind; meditative. "},{"w":"abbreviated","c":"1","s":"5","d":"adj\tShortened; made briefer. ; adj\tRelatively short; shorter than normal, or compared to others. ; adj\tScanty, as in clothing. "},{"w":"abhorred","c":"1","s":"2","d":"adj\tStrongly disliked: hated, despised. ; adj\t(obsolete) Horrified. "},{"w":"abominable","c":"1","s":"5","d":"adj\tWorthy of, or causing, abhorrence, as a thing of evil omen; odious in the utmost degree; very hateful; detestable; loathsome; execrable. ; adj\t(obsolete) Excessive, large (used as an intensifier). ; adj\tVery bad or inferior. ; adj\tDisagreeable or unpleasant. "},{"w":"aback","c":"1","s":"2","d":"adv\t(archaic) Towards the back or rear; backwards. ; adv\t(archaic) In the rear; a distance behind. ; adv\tBy surprise; startled; dumbfounded. (see usage) ; adv\t(nautical) Backward against the mast; said of the sails when pressed by the wind from the \"wrong\" (forward) side, or of a ship when its sails are set that way. ; n\t(obsolete) An abacus. "},{"w":"aborning","c":"1","s":"3","d":"adv\t(chiefly Canada, US) That is in the process of being born; coming into existence; before coming to completion. ; adj\t(chiefly Canada, US) While being born or produced. "},{"w":"ab initio","c":"1","s":"5","d":"adv\t(law) From the time when a law, legal right or decree, contract, ownership interest, partnership (etc.) comes into force. ; adv\t(sciences) Calculated from first principles, i.e. from basic laws without any further additional assumptions. ; adv\t(of an academic course) Taken with no prior qualifications. "},{"w":"abeam","c":"1","s":"2","d":"adv\t(nautical, aircraft) On the beam; at a right angle to the centerline or keel of a vessel or aircraft; being at a bearing approximately 090 Degrees or 270 Degrees relative. ; adv\t(nautical, aircraft) Alongside or abreast; opposite the center of the side of the ship or aircraft. ; adj\t(nautical, aircraft) Alongside or abreast; opposite the center of the side of the ship or aircraft. ; adj\tBeaming, shining (especially with reference to a person\u0027s face or eyes). "},{"w":"abaft","c":"1","s":"2","d":"adv\t(nautical) On the aft side; in the stern. ; adv\t(nautical, obsolete) Backwards. "},{"w":"abit","c":"1","s":"2","d":"adv\t(nonstandard, proscribed) Alternative form of a bit. [(informal) To a small extent; in a small amount.] "},{"w":"abloom","c":"1","s":"2","d":"adv\t(postpositive) In or into bloom; in a blooming state; having flower blooms unfolding. ; adj\tBlooming; covered in flowers. ; adj\t(figuratively) Having something growing or grown. ; adj\tThriving in health, beauty, and vigor; exhibiting youth-like beauty. "},{"w":"abroad","c":"1","s":"2","d":"adv\tBeyond the bounds of a country; in foreign countries. ; adv\t(dated) At large; widely; broadly; over a wide space. ; adv\t(dated) Without a certain confine; outside the house; away from one\u0027s abode. ; adv\t(dated) Before the public at large; throughout society or the world; here and there; moving without restriction. ; adv\tNot on target; astray; in error; confused; dazed. ; adv\t(sports) Played elsewhere than one\u0027s home grounds. ; n\t(rare, Scotland) Countries or lands abroad. "},{"w":"above","c":"1","s":"2","d":"adv\tDirectly overhead; vertically on top of. ; adv\tHigher in the same page; earlier in the order as far as writing products go. ; adv\tInto or from heaven; in the sky. ; adv\tIn a higher place; upstairs; farther upstream. ; adv\tHigher in rank, power, or position. ; adv\t(archaic) In addition. ; adv\tMore in number. ; adv\tAbove zero; above freezing. ; adv\t(biology) On the upper half or the dorsal surface of an animal. ; adj\tOf heaven; heavenly. ; adj\t(by ellipsis) Being located higher on the same page or on a preceding page. ; n\tHeaven. ; n\tSomething, especially a person\u0027s name in legal documents, that appears higher on the same page or on a preceding page. ; n\tHigher authority. ; n\t(archaic) betterment, raised status or condition. "},{"w":"aberrantly","c":"1","s":"4","d":"adv\tIn an aberrant manner; abnormally. "},{"w":"ably","c":"1","s":"2","d":"adv\tIn an able manner; with great ability. "},{"w":"abruptly","c":"1","s":"3","d":"adv\tIn an abrupt manner; without giving notice, or without the usual forms; suddenly; precipitously. "},{"w":"absolutely","c":"1","s":"4","d":"adv\tIn an absolute or unconditional manner; utterly, positively, wholly. ; adv\tIndependently; viewed without relation to other things or factors. ; adv\t(grammar) In a manner that does not take an object. "},{"w":"abstractly","c":"1","s":"3","d":"adv\tIn an abstract way or manner ; adv\tseparately; absolutely "},{"w":"abundantly","c":"1","s":"4","d":"adv\tIn an abundant manner; in a sufficient degree; in large measure. ; adv\tExtremely. "},{"w":"abed","c":"1","s":"2","d":"adv\tIn bed, or on the bed; confined to bed. ; adv\tTo childbed ; n\tA male given name from Arabic ; n\tA surname. "},{"w":"abdominally","c":"1","s":"5","d":"adv\tIn the area of the abdomen. "},{"w":"about","c":"1","s":"2","d":"adv\tOn all sides; around. ; adv\tHere and there; around; in one place and another; up and down. ; adv\tFrom one place or position to another in succession; indicating repeated movement or activity. ; adv\tIndicating unproductive or unstructured activity. ; adv\tNearly; approximately; with close correspondence in quality, manner, degree, quantity, or time; almost. ; adv\tNear; in the vicinity. ; adv\tTo a reversed order; half round; facing in the opposite direction; from a contrary point of view. ; adv\t(nautical) To the opposite tack: see go about. ; adv\t(obsolete or rare) In succession; one after another; in the course of events. ; adv\t(archaic) In circuit; circularly; by a circuitous way; around the outside; in circumference. ; adj\tMoving around; astir. ; adj\tIn existence; being in evidence; apparent. ; adj\tNear; in the vicinity or neighbourhood. "},{"w":"aboard","c":"1","s":"2","d":"adv\tOn board; into or within a ship or boat; hence, into or within a railway car. ; adv\tOn or onto a horse, a camel, etc. ; adv\t(baseball) On base. ; adv\tInto a team, group, or company. ; adv\t(nautical) Alongside. "},{"w":"abreast","c":"1","s":"2","d":"adv\tSide by side and facing forward. ; adv\t(figuratively) Alongside; parallel to. ; adv\tInformed, well-informed, familiar, acquainted. ; adv\tFollowed by of or with: up to a certain level or line; equally advanced. ; adv\t(Scotland) Breast high (of an advancing wave). ; adv\t(nautical) Side by side; also, opposite; on a line with the vessel\u0027s beam. ; adv\t(obsolete) At the same time; simultaneously. ; adj\tSide by side, facing forward. ; adj\t(figuratively) Alongside; parallel to. ; adj\tInformed, well-informed, familiar, acquainted. ; adj\tUp to a certain level or line; equally advanced ; adj\t(nautical) Side by side; also, opposite; over against; on a line with the vessel\u0027s beam. "},{"w":"abarticulation","c":"1","s":"6","d":"n\t(anatomy) An articulation, especially one that permits free motion in the joint; a hinge joint. ; n\tThe act of dislocating a joint. ; n\t(anatomy) A term sometimes used for diarthrosis, and also for synarthrosis. Also called dearticulation. "},{"w":"abysm","c":"1","s":"2","d":"n\t(archaic, poetic) Hell; the infernal pit; the great deep; the primal chaos. ; n\t(now chiefly literary) An abyss; a gulf, a chasm, a very deep hole. "},{"w":"abo","c":"1","s":"2","d":"n\t(Australia, offensive, ethnic slur, slang) An aborigine; aboriginal. ; n\t(medicine) The most important blood type classification system for human blood transfusions. ; n\tAlternative letter-case form of abo [(Australia, offensive, ethnic slur, slang) An aborigine; aboriginal.] "},{"w":"abilene","c":"1","s":"3","d":"n\t(biblical) A region of Syria south and southeast of Damascus. ; n\tA city, the county seat of Taylor County, in west-central Texas, west-southwest of Fort Worth; founded in 1881 with the coming of the railroad, the city first prospered as a shipping center for cattle. ; n\tA city, the county seat of Dickinson County, Kansas. ; adj\t(archaeology) Belonging to a prehistoric culture of central Texas, characterized by oval grinding stones. "},{"w":"abel","c":"1","s":"2","d":"n\t(biblical) The son of Adam and Eve who was killed by his brother Cain. ; n\tA male given name from Hebrew. ; n\tA surname originating as a patronymic. "},{"w":"abalone","c":"1","s":"4","d":"n\t(Canada, US, Australia) An edible univalve mollusc of the genus Haliotis, having a shell lined with mother-of-pearl. ; n\t(Canada, US, Australia) The meat of the aforementioned mollusc. "},{"w":"ablution","c":"1","s":"3","d":"n\t(chemistry) Originally, the purifying of oils and other substances by emulsification with hot water; now more generally, a thorough cleansing of a precipitate or other non-dissolved substance. ; n\tThe act of washing or cleansing the body, or some part of it, as a religious rite. ; n\t(literary or humorous, usually in the plural) Washing oneself; bathing, cleaning oneself up. ; n\t(Western Christianity) The rinsing of the priest\u0027s hand and the sacred vessel following the Communion with, depending on rite, water or a mix of it and wine, which may then be drunk by the priest. ; n\tThe liquid used in the cleansing or ablution. ; n\t(Eastern Orthodoxy) The ritual consumption by the deacon or priest of leftover sacred wine of host after the Communion. ; n\t(plural only, UK, military) The location or building where the showers and basins are located. "},{"w":"abetment","c":"1","s":"3","d":"n\t(chiefly law) The act of abetting or assisting in a crime, wrongdoing etc. ; n\tEncouragement or assistance. "},{"w":"abridgement","c":"1","s":"3","d":"n\t(chiefly UK) Alternative form of abridgment [(US) The act of abridging; reduction or deprivation] "},{"w":"abba","c":"1","s":"2","d":"n\t(Christianity, Judaism) Father; religious superior; in the Syriac, Coptic, and Ethiopic churches, a title given to the bishops, and by the bishops to the patriarch; a title given to Jewish scholars in the Talmudic period. ; n\t(Christianity) Father, an honorific title given to God in the New Testament, especially used in prayers. ; n\tA popular Swedish music group from the 1970ies, one of the best-selling music artists in history. ; n\tAlternative form of aba (Middle Eastern garment). [A coarse, often striped, felted fabric from the Middle East, woven from goat or camel hair.] "},{"w":"abend","c":"1","s":"2","d":"n\t(computing) The abnormal termination of a program. ; n\t(IEEE) Termination of a process prior to completion. ; v\t(computing) To terminate abnormally. ; n\tA surname from German. ; n\tAlternative spelling of abend [(computing) The abnormal termination of a program.] ; adj\tAcronym of absent by enforced net deprivation. "},{"w":"abomination","c":"1","s":"5","d":"n\t(countable) An abominable act; a disgusting vice; a despicable habit. ; n\t(uncountable) The feeling of extreme disgust and hatred ; n\t(obsolete, uncountable) A state that excites detestation or abhorrence; pollution. ; n\t(countable) That which is abominable, shamefully vile; an object that excites disgust and hatred; very often with religious undertones. "},{"w":"absurdity","c":"1","s":"4","d":"n\t(countable) That which is absurd; an absurd action; a logical contradiction. ; n\t(uncountable) The quality of being absurd or inconsistent with obvious truth, reason, or sound judgment. ; n\t(obsolete, rare) Dissonance. "},{"w":"absolution","c":"1","s":"4","d":"n\t(ecclesiastical) An absolving of sins from ecclesiastical penalties by an authority. ; n\tThe forgiveness of sins, in a general sense. ; n\tThe form of words by which a penitent is absolved. ; n\tAn absolving, or setting free from guilt, sin, or penalty; forgiveness of an offense. ; n\t(civil law, obsolete) An acquittal, or sentence of a judge declaring an accused person innocent. ; n\t(obsolete) Delivery, in speech. "},{"w":"abstraction","c":"1","s":"3","d":"n\t(euphemistic) The taking surreptitiously for one\u0027s own use part of the property of another; purloining. ; n\t(engineering) Removal of water from a river, lake, or aquifer. ; n\tA separation from worldly objects; a recluse life; the withdrawal from one\u0027s senses. ; n\tThe act of focusing on one characteristic of an object rather than the object as a whole group of characteristics; the act of separating said qualities from the object or ideas. ; n\tAny characteristic of an individual object when that characteristic has been separated from the object and is contemplated alone as a quality having independent existence. ; n\tA member of an idealized subgroup when contemplated according to the abstracted quality which defines the subgroup. ; n\tThe act of comparing commonality between distinct objects and organizing using those similarities; the act of generalizing characteristics; the product of said generalization. ; n\tAn idea or notion of an abstract or theoretical nature. ; n\tAbsence or absorption of mind; inattention to present objects; preoccupation. ; n\t(art) An abstract creation, or piece of art; qualities of artwork that are free from representational aspects. ; n\t(chemistry) A separation of volatile parts by the act of distillation. ; n\tAn idea of an idealistic, unrealistic or visionary nature. ; n\tThe result of mentally abstracting an idea; the product of any mental process involving a synthesis of: separation, despecification, generalization, and ideation in any of a number of combinations. ; n\t(geology) The merging of two river valleys by the larger of the two deepening and widening so much so, as to assimilate the smaller. ; n\t(computing) Any generalization technique that ignores or hides details to capture some kind of commonality between different instances for the purpose of controlling the intellectual complexity of engineered systems, particularly software systems. ; n\t(computing) Any intellectual construct produced through the technique of abstraction. "},{"w":"abscissa","c":"1","s":"3","d":"n\t(geometry) The first of the two terms by which a point is referred to, in a system of fixed rectilinear coordinate (Cartesian coordinate) axes. ; n\t(geometry) The horizontal line representing an axis of a Cartesian coordinate system, on which the abscissa (sense above) is shown. "},{"w":"abacus","c":"1","s":"3","d":"n\t(historical, obsolete) A table or tray scattered with sand which was used for calculating or drawing. ; n\tA device used for performing arithmetical calculations; (rare) a table on which loose counters are placed, or (more commonly) an instrument with beads sliding on rods, or counters in grooves, with one row of beads or counters representing units, the next tens, etc. ; n\t(architecture) The uppermost portion of the capital of a column immediately under the architrave, in some cases a flat oblong or square slab, in others more decorated. ; n\t(Ancient Greece, Ancient Rome, historical) A board, tray, or table, divided into perforated compartments for holding bottles, cups, or the like; a kind of buffet, cupboard, or sideboard. "},{"w":"abaci","c":"1","s":"3","d":"n\t(historical, obsolete) A table or tray scattered with sand which was used for calculating or drawing. ; n\tA device used for performing arithmetical calculations; (rare) a table on which loose counters are placed, or (more commonly) an instrument with beads sliding on rods, or counters in grooves, with one row of beads or counters representing units, the next tens, etc. ; n\t(architecture) The uppermost portion of the capital of a column immediately under the architrave, in some cases a flat oblong or square slab, in others more decorated. ; n\t(Ancient Greece, Ancient Rome, historical) A board, tray, or table, divided into perforated compartments for holding bottles, cups, or the like; a kind of buffet, cupboard, or sideboard. "},{"w":"abyssinia","c":"1","s":"4","d":"n\t(historical) Ethiopian Empire (Ethiopia and Eritrea). ; adj\t(dated) Ethiopian; Eritrean; Abyssinian. "},{"w":"ab","c":"1","s":"1","d":"n\t(informal) abdominal muscle. ; n\t(slang) An abscess caused by injecting an illegal drug, usually heroin. ; v\t(climbing, informal) To abseil. ; n\t(US) The early stages of; the beginning process; the start. ; n\tA blood type of the ABO system that has both blood antigens and may receive all blood types, and donate to AB. ; n\t(countable) A person with this blood type. ; n\t(immunology) Antibody. ; n\t(Judaism) Av. ; n\tA diminutive of the male given name Abner, from Hebrew, occasionally used as a formal given name. ; n\t(dated) In Egyptian belief, the heart and will and conscience of a person, especially that of the recently deceased which proceeds to the afterlife and is weighed as evidence during his or her judgement. ; n\t(dated) An Ancient Egyptian amulet in the shape of a heart (ib). ; v\tAbbreviation of abort. [(intransitive, now rare outside medicine) To miscarry; to bring forth (non-living) offspring prematurely.] ; n\tAbbreviation of abortion. [(medicine) The expulsion from the womb of a foetus or embryo before it is fully developed, with loss of the foetus; either naturally as a spontaneous abortion (now usually called a miscarriage), or deliberately as an induced abortion.] ; adv\tAbbreviation of about. [On all sides; around.] ; n\tAbbreviation of Alberta, a province of Canada. [A province in western Canada. Capital: Edmonton.] ; n\tInitialism of Artium baccalaureus. ; n\tInitialism of able seaman; able-bodied seaman. ; n\tInitialism of adult baby. [A person who has a paraphilia involving role-playing a regression to an infant-like state, wearing diapers, etc.] ; n\tInitialism of afterburner. [(aviation) A device in a jet engine which injects fuel into the exhaust system to increase the thrust.] ; n\tInitialism of aid to the blind. ; n\t(military, aviation) Initialism of airbase. ; n\t(organic chemistry) Abbreviation of alkylbenzene. [(organic chemistry) Any hydrocarbon formally derived from benzene by replacing one or more hydrogen atoms with alkyl groups] ; n\t(medicine) Initialism of antibody. [(immunology) A protein produced by B-lymphocytes that binds to a specific antigen.] ; n\tInitialism of artificial breeding. ; n\t(law, politics) Initialism of assembly bill. ; adj\tInitialism of airborne. [In or carried by the air.] ; adj\tInitialism of antiballistic. [(military, of a missile, or system) designed to detect, intercept, and destroy a ballistic missile in flight] ; adj\t(baseball) Initialism of at bat. ; n\t(title) Abbreviation of Abbot. [A surname.] "},{"w":"abs","c":"1","s":"3","d":"n\t(informal) The abdominal muscles. plural of ab ; n\tplumbing pipes composed of this plastic. ; n\t(rugby) All Blacks, the New Zealand national rugby team. ; adj\tAbbreviation of abstract. [(obsolete) Derived; extracted.] ; n\tAcronym of absolute temperature. [Thermodynamic temperature; temperature measured on an absolute scale such as the Kelvin scale.] ; n\t(mathematics) Initialism of absolute value function. ; n\t(automotive) Initialism of antilock braking system. ; n\t(organic chemistry) Initialism of acrylonitrile butadiene styrene. ; n\t(plumbing, informal, humorous) Initialism of all-black stuff: i.e. acrylonitrile butadiene styrene, referring to the black color of the waste water ; n\tInitialism of automatic block signaling. ; n\tInitialism of auto-brewery syndrome. [(pathology) A condition in which the contents of the sufferer’s stomach ferment, creating alcohol.] "},{"w":"abraham","c":"1","s":"3","d":"n\t(Judaism, Christianity, Islam, Baha\u0027i) A prophet in the Old Testament, Qur\u0027an and Aqdas; a Semitic patriarch who preached monotheism, father of the Jewish patriarch Isaac and the Arab patriarch Ishmael. ; n\tA male given name from Hebrew. ; n\tA surname originating as a patronymic. ; n\tThe 14th sura (chapter) of the Qur\u0027an. ; n\t(archaic, British slang, chiefly London) A shop selling cheap and low-quality clothes, especially in the East End of London. "},{"w":"abator","c":"1","s":"3","d":"n\t(law) a person who, without right, enters into a freehold on the death of the last possessor, before the heir or devisee ; n\t(law) one who abates, ends, or does away with a nuisance "},{"w":"abeyance","c":"1","s":"3","d":"n\t(law) Expectancy; a condition when an ownership of real property is undetermined; lapse in succession of ownership of estate, or title. ; n\tSuspension; temporary suppression; dormant condition. ; n\t(heraldry) Expectancy of a title, its right in existence but its exercise suspended. "},{"w":"abasia","c":"1","s":"3","d":"n\t(medicine) An inability to walk due to a defect in muscular coordination. "},{"w":"abortion","c":"1","s":"3","d":"n\t(medicine) The expulsion from the womb of a foetus or embryo before it is fully developed, with loss of the foetus; either naturally as a spontaneous abortion (now usually called a miscarriage), or deliberately as an induced abortion. ; n\t(now rare) An aborted foetus; an abortus. ; n\t(figuratively) A misshapen person or thing; a monstrosity. ; n\t(figuratively) Failure or abandonment of a project, promise, goal etc. ; n\t(biology) Arrest of development of any organ, so that it remains an imperfect formation or is absorbed. ; n\tThe cessation of an illness or disease at a very early stage. "},{"w":"abort","c":"1","s":"2","d":"n\t(military, aeronautics) An early termination of a mission, action, or procedure in relation to missiles or spacecraft; the craft making such a mission. ; n\t(computing) The function used to abort a process. ; n\t(computing) An event in which a process is aborted. ; n\t(now rare) The product of a miscarriage; an aborted offspring; an abortion. ; n\t(obsolete) A miscarriage; an untimely birth; an abortion. ; v\t(intransitive, now rare outside medicine) To miscarry; to bring forth (non-living) offspring prematurely. ; v\t(transitive, intransitive) To cause a premature termination of (a fetus); to end a pregnancy before term. ; v\t(transitive) To end prematurely; to stop in the preliminary stages; to turn back. ; v\t(intransitive) To stop or fail at something in the preliminary stages. ; v\t(intransitive, biology) To become checked in normal development, so as either to remain rudimentary or shrink away wholly; to cease organic growth before maturation; to become sterile. ; v\t(transitive, biology) To cause an organism to develop minimally; to cause rudimentary development to happen; to prevent maturation. ; v\t(intransitive, military) To abandon a mission at any point after the beginning of the mission and prior to its completion. ; v\t(transitive, aeronautics) To terminate a mission involving a missile or rocket; to destroy a missile or rocket prematurely. ; v\t(transitive, computing) To terminate a process prior to completion. "},{"w":"about-face","c":"1","s":"3","d":"n\t(military) An abrupt turn to face the opposite direction. ; n\tA reversal in direction; a reversal of attitude or opinion. ; v\t(intransitive) To turn 180 degrees to face the opposite direction. ; v\tTo change opinion or attitude drastically. "},{"w":"ablation","c":"1","s":"3","d":"n\t(obsolete) A carrying or taking away; removal. ; n\t(surgery) The surgical removal of a body part, an organ, or especially a tumor; the removal of an organ function; amputation. ; n\t(geology) The removal of a glacier by melting and evaporation; the lowering of a land surface by any of several means, as in wind erosion or mass wasting. ; n\t(meteorology) The depletion of surface snow and ice from a spacecraft or meteorite through melting and evaporation caused by friction with the atmosphere. "},{"w":"aboding","c":"1","s":"3","d":"n\t(obsolete) A foreboding. "},{"w":"abigail","c":"1","s":"3","d":"n\t(obsolete) A lady\u0027s maid. ; n\tThe wife of Nabal and later of David in the Old Testament. ; n\tA female given name from Hebrew, used since the 16th century, and currently quite popular. "},{"w":"abode","c":"1","s":"2","d":"n\t(obsolete) Act of waiting; delay. ; n\t(dated or law) Stay or continuance in a place; sojourn. ; n\t(formal) A residence, dwelling or habitation. ; n\t(obsolete) An omen; a foretelling. ; v\t(transitive, obsolete) To bode; to foreshow; to presage. ; v\t(intransitive, obsolete) To be ominous. "},{"w":"absorption","c":"1","s":"3","d":"n\t(obsolete) engulfing; swallowing up, as of bodies or land. ; n\tassimilation; incorporation. ; n\t(chemistry, physics) the imbibing or reception by molecular or chemical action, of radiant energy; the process of being neutrons being absorbed by the nucleus; interception. ; n\t(meteorology) The process in which incident radiant energy is retained by a substance (such as an air mass) by conversion to some other form of energy (such as heat). ; n\t(physiology) in living organisms, the process by which the materials of growth and nutrition are absorbed and conveyed to the tissues and organs; taking in by various means, such as by osmosis. ; n\tEntire engrossment or occupation of the mind. ; n\tMental assimilation. ; n\t(electrical engineering) The retaining of electrical energy for a short time after it has been introduced to the dielectric. "},{"w":"abusion","c":"1","s":"3","d":"n\t(obsolete) Misuse, abuse. ; n\t(obsolete) Abuse of the truth; deceit, lying. ; n\t(obsolete) Violation of law or propriety; outrage, improper behaviour. ; n\t(obsolete) Catachresis. ; n\t(obsolete) Physical, mental, verbal, or sexual abuse. "},{"w":"ability","c":"1","s":"4","d":"n\t(obsolete) Suitableness. ; n\t(uncountable) The quality or state of being able; capacity to do or of doing something; having the necessary power. ; n\tThe legal wherewithal to act. ; n\t(now limited to Scotland dialects) Physical power. ; n\t(archaic) Financial ability. ; n\t(uncountable) A unique power of the mind; a faculty. ; n\t(countable) A skill or competence in doing; mental power; talent; aptitude. "},{"w":"abilities","c":"1","s":"4","d":"n\t(obsolete) Suitableness. ; n\t(uncountable) The quality or state of being able; capacity to do or of doing something; having the necessary power. ; n\tThe legal wherewithal to act. ; n\t(now limited to Scotland dialects) Physical power. ; n\t(archaic) Financial ability. ; n\t(uncountable) A unique power of the mind; a faculty. ; n\t(countable) A skill or competence in doing; mental power; talent; aptitude. "},{"w":"abdication","c":"1","s":"4","d":"n\t(obsolete) The act of disowning or disinheriting a child. ; n\tThe act of abdicating; the renunciation of a high office, dignity, or trust, by its holder. ; n\tThe voluntary renunciation of sovereign power. ; n\t(obsolete, law) The renunciation of interest in a property or a legal claim; abandonment. ; n\t(obsolete) The action of being deposed from the seat of power. "},{"w":"abstention","c":"1","s":"3","d":"n\t(obsolete) The act of restraining oneself. ; n\tThe act of abstaining or refraining (from). ; n\tThe act of declining to vote on a particular issue. ; n\tNon-participation in the political world; as a country avoiding international affairs. "},{"w":"abdomen","c":"1","s":"3","d":"n\t(obsolete) The fat surrounding the belly. ; n\t(anatomy) The belly, or that part of the body between the thorax and the pelvis, not including the back; or in some lower vertebrates, the portion between the cardiac and caudal regions. ; n\t(anatomy) The cavity of the belly, which is lined by the peritoneum, and contains the viscera; often restricted in humans to the part between the diaphragm and the commencement of the pelvis, the remainder being called the pelvic cavity. ; n\t(zoology, entomology) The posterior section of the body, behind the thorax, in insects, crustaceans, and other Arthropoda. "},{"w":"aborigine","c":"1","s":"5","d":"n\t(offensive) An Aboriginal person from Australia (descending from, or a member of, one of the indigenous people(s) before British colonization), Aboriginal Australian. ; n\tA native inhabitant of a country; a member of the original people. ; n\t(in the plural) The native flora and fauna of an area. "},{"w":"abscess","c":"1","s":"2","d":"n\t(pathology) A cavity caused by tissue destruction, usually because of infection, filled with pus and surrounded by inflamed tissue. ; v\t(intransitive) To form a pus-filled cavity, typically from an infection. "},{"w":"ablaut","c":"1","s":"2","d":"n\t(phonology) The substitution of one root vowel for another, thus indicating a corresponding modification of use or meaning; vowel permutation, distinct from the phonetic influence of a succeeding vowel. ; v\t(intransitive, linguistics, of a vowel-containing linguistic component) To undergo a change of vowel. ; v\t(transitive, linguistics) To cause to change a vowel. "},{"w":"abulia","c":"1","s":"4","d":"n\t(psychiatry) Absence of willpower or decisiveness, especially as a symptom of mental illness. "},{"w":"abreaction","c":"1","s":"4","d":"n\t(psychoanalysis) The re-living of an experience with a view to purging its emotional dross. "},{"w":"abuttal","c":"1","s":"3","d":"n\t(rare, plural only) The butting or boundary of land, particularly at the end; buttals. ; n\tAn abutment. ; n\tThe act of abutting. ; v\t(transitive) To describe a piece of land in terms of its abuttals. "},{"w":"abecedary","c":"1","s":"5","d":"n\t(rare) The alphabet, written out in a teaching book, or carved on a wall; a primer; abecedarium. ; n\tOne that teaches or learns the alphabet or the fundamentals of any subject; abecedarian. ; adj\tReferring to the alphabet; alphabetical; related to or resembling an abecedarius; abecedarian. "},{"w":"abating","c":"1","s":"3","d":"n\t(rhetoric) Anesis. "},{"w":"absolutism","c":"1","s":"5","d":"n\t(theology) Doctrine of preordination; doctrine of absolute decrees; doctrine that God acts in an absolute manner. ; n\t(political science, sociology) The principles or practice of absolute or arbitrary government; despotism. ; n\t(philosophy) Belief in a metaphysical absolute; belief in Absolute. ; n\tPositiveness; the state of being absolute. ; n\t(rare) The characteristic of being absolute in nature or scope; absoluteness. "},{"w":"abc","c":"1","s":"3","d":"n\t(uncountable, countable, usually plural in Canada, US) The English alphabet. ; n\t(obsolete, poetry) A type of poem in which the lines start with the letters of the alphabet in order. ; n\t(obsolete) A primer for teaching the Latin alphabet and first elements of reading. ; n\tThe fundamentals of any subject. ; n\t(poker) A straightforward, uniform playing style, often focusing on betting for value, folding weak hands, and avoiding bluffing. ; n\t(UK, rail transport) A British alphabetized guidebook listing trains and their stations. ; n\t(computer languages) An imperative general-purpose programming language, intended for teaching or prototyping. ; n\t(mnemonic, emergency medicine) Initialism of airway, breathing and circulation: the essential steps in the immediate assessment and treatment of critically ill or injured patients. [(anatomy) The trachea.] ; n\t(US) Initialism of alcoholic beverage control. ; n\tInitialism of American-born Chinese. ; n\tInitialism of Australian-born Chinese. ; n\t(business management) Initialism of activity-based costing. ; n\t(climbing) Initialism of advance base camp. ; n\t(biochemistry) Initialism of ATP-binding cassette. ; n\t(computing) Initialism of Atanasoff-Berry computer. ; n\t(immunology, medicine) Initialism of antigen-binding capacity. ; n\t(medicine) Initialism of aneurysmal bone cyst. ; n\t(medicine) Initialism of adenoid basal cell carcinoma. ; n\t(pharmacology) Abbreviation of abacavir. [(pharmacology) An antiretroviral drug (trademark Ziagen) taken orally in the form of its sulfate (C₁₄H₁₈N₆O)₂·H₂SO₄ in combination with other antiretroviral drugs to treat HIV infections. It is a synthetic nucleoside analog that acts by inhibiting reverse transcriptase. It causes potentially serious hypersensitivity reactions in a small percentage of patients.] ; n\t(law, finance) Initialism of assignment for the benefit of creditors. ; n\t(electrical engineering) Initialism of absorbing boundary condition. ; n\t(object-oriented programming) Initialism of abstract base class. ; n\t(psychology) Initialism of adventure-based counseling. ; n\t(psychology) Initialism of Affect, Behavior, and Cognition. ; n\t(cryptozoology) Initialism of alien big cat. ; n\t(automotive) Initialism of active body control. ; n\t(Christianity, informal) Initialism of Archbishop of Canterbury. ; n\t(television) Initialism of American Broadcasting Company: an American commercial broadcast television network founded in 1943. ; n\t(radio, television) Initialism of Australian Broadcasting Corporation. ; n\t(historical, radio) Initialism of Australian Broadcasting Company. ; n\t(historical, radio, television) Initialism of Australian Broadcasting Commission. ; n\t(radio, television) Initialism of Asahi Broadcasting Corporation. ; n\t(finance) Initialism of Agricultural Bank of China. ; n\t(publishing) Initialism of Audit Bureau of Circulations. ; n\t(UK, historical) Initialism of Aerated Bread Company; also A.B.C. ; n\t(aviation) Initialism of Advance Booking Charter. ; n\t(historical, basketball) Initialism of Asian Basketball Confederation. ; n\t(historical, bowling) Initialism of American Bowling Congress. ; n\tInitialism of Santo André, São Bernardo do Campo and São Caetano do Sul: satellite cities around the city of São Paulo that form the most important industrial area in Brazil. ; n\t(US, rail transport) Initialism of Atlanta, Birmingham and Coast Railroad. [The capital city, the county seat of Fulton County, Georgia, United States.] ; n\tInitialism of American Book Center: an English-language bookstore in Amsterdam founded in 1972. ; n\t(Christianity) Initialism of Anglican Book Centre: the publishing house and bookshop of the Anglican Church of Canada until 2013. ; adj\t(weaponry) Initialism of atomic, biological and chemical: the three main categories of weapon of mass destruction. [(physics, chemistry) Of or relating to atoms; composed of atoms; monatomic.] ; adj\t(slang, of a piece of chewing gum) Initialism of already been chewed. ; adj\t(medicine, of diffuse large B-cell lymphoma) Initialism of activated B-cell-like. "},{"w":"abcs","c":"1","s":"3","d":"n\t(US, usually plural only, countable) The alphabet. ; n\t(obsolete, poetry) A type of poem in which the lines start with the letters of the alphabet in order. ; n\t(plural only) Letters; writing; the skill of literacy. ; n\tThe alphabet, especially the English alphabet. ; n\tThe callsign for the Ceduna station of the Australian Broadcasting Corporation "},{"w":"ablutions","c":"1","s":"3","d":"n\tA building that houses bathing and toilet facilities on a military base. ; n\t(plural only, UK, military) The location or building where the showers and basins are located. "},{"w":"aba","c":"1","s":"3","d":"n\tA coarse, often striped, felted fabric from the Middle East, woven from goat or camel hair. ; n\tA loose-fitting sleeveless garment, made from aba or silk, worn by Arabs. ; n\tAn outer garment made of the above, very simple in form, worn by the Arabs of the desert. The illustration shows such an aba, made of two breadths of stuff sewed together to make an oblong about four by nine feet. ; n\tAn altazimuth used for astronomy on either land or water. ; n\tThe electric fish Gymnarchus niloticus (frankfish, freshwater rat-tail, African knifefish), found in swamps, lakes and rivers in Africa. ; n\tThe largest city in Abia State, Nigeria. ; n\tSynonym of Ngawa: the Mandarin Chinese-derived name. ; n\tInitialism of Amateur Boxing Association. ; n\tInitialism of American Bar Association. ; n\tInitialism of American Booksellers Association. ; n\tInitialism of applied behavior analysis. "},{"w":"absconce","c":"1","s":"2","d":"n\tA dark lantern used in church to read prayers etc during a service. "},{"w":"abnegation","c":"1","s":"4","d":"n\tA denial; a renunciation; denial of desire or self-interest. "},{"w":"abby","c":"1","s":"2","d":"n\tA diminutive of the female given name Abigail, from Hebrew, also used as a formal given name. ; n\tA diminutive of the male given name Albert, from the Germanic languages ; n\tObsolete spelling of abbey [The office or dominion of an abbot or abbess.] "},{"w":"abe","c":"1","s":"1","d":"n\tA diminutive of the male given name Abraham, from Hebrew. ; n\t(slang, US) A five-dollar bill. ; n\tA surname from Japanese. ; v\t(intransitive, infinitive, Britain, uncommon) To be. ; n\t(humorous, especially Ireland, Scotland and Wales) Initialism of anyone but England: any team playing a sports match against the England team. "},{"w":"abbess","c":"1","s":"2","d":"n\tA female superior or governess of a nunnery, or convent of nuns, having the same authority over the nuns which the abbots have over the monks. ; n\t(archaic, British slang) A woman who runs a brothel; a woman employed by a prostitute to find clients. "},{"w":"aber","c":"1","s":"2","d":"n\tA hamlet in Llanwenog, Ceredigion, Wales ; n\tA hamlet in Talybont-on-Usk, Powys, Wales ; n\tA suburb of Caerphilly, Caerphilly county borough, Wales ; n\t(local slang) Clipping of Aberystwyth. [A coastal town and community with a town council in Ceredigion, Wales (OS grid ref SN5881).] ; n\t(local slang) Clipping of Abergwyngregyn. "},{"w":"abu","c":"1","s":"2","d":"n\tA language of Papua New Guinea. ; n\tAb, the fifth month of the Babylonian calendar. ; n\t(mythology) A minor god of vegetation in Sumerian mythology. ; n\tThe ancient Egyptian name for the city of Elephantine, near modern day Aswan. ; n\tA volcano on the island of Honshū in Japan. ; n\tAbu, Yamaguchi, a town in Japan. ; n\tMount Abu, the highest mountain in the Indian state of Rajasthan. ; n\t(UK, soccer, slang) Initialism of anyone but United: a fan who dislikes Manchester United and will support any team that is playing against them. "},{"w":"abundance","c":"1","s":"3","d":"n\tA large quantity; many. ; n\tAn overflowing fullness or ample sufficiency; profusion; copious supply; superfluity; plentifulness. ; n\tWealth; affluence; plentiful amount of resources. ; n\tFrequency, amount, ratio of something within a given environment or sample. ; n\t(card games) A bid to take nine or more tricks in solo whist. ; n\t(Scotland) enough, sufficiency. "},{"w":"abjection","c":"1","s":"3","d":"n\tA low or downcast condition; meanness of spirit; abasement; degradation. ; n\t(obsolete, chiefly figuratively) Something cast off; garbage. ; n\t(obsolete) The act of bringing down or humbling; casting down. ; n\t(obsolete) The act of casting off; rejection. ; n\t(biology, mycology) The act of dispersing or casting off spores. "},{"w":"abbas","c":"1","s":"2","d":"n\tA male given name from Arabic ; n\tA surname from Arabic. "},{"w":"abdul","c":"1","s":"2","d":"n\tA male given name from Arabic used by Muslims. "},{"w":"abradant","c":"1","s":"3","d":"n\tA material used for grinding, as emery, sand, powdered glass, etc.; an abrasive. ; adj\tTending to abrade; causing irritation; abrasive. "},{"w":"abatis","c":"1","s":"3","d":"n\tA means of defense formed by felled trees, or sometimes by bent trees, the ends of whose branches are sharpened and directed outwards, or against the enemy, and more recently fortified with barbed wire. ; n\t(historical) In the Middle Ages, an officer of the stables who had the care of measuring out the provender; an avenor. ; n\tIn coal-mining, walls of cord-wood piled up crosswise to keep the underground roads open so as to secure ventilation. "},{"w":"absconder","c":"1","s":"3","d":"n\tA person who absconds. "},{"w":"absentee","c":"1","s":"3","d":"n\tA person who is absent from his or her employment, school, post, duty, etc. ; n\t(chiefly Britain, historical) A landholder who lives in another district or country than the one in which his estate is situated. ; n\tOne that is nonexistent or lacking. ; n\tA voter that is not present at the time of voting; absentee voter. ; adj\t(attributive) Pertaining to one that is absent. "},{"w":"aberdeen","c":"1","s":"3","d":"n\tA port city in Aberdeen council area, Scotland, on the North Sea. ; n\tA council area of Scotland including the city, one of 32 created in 1996. ; n\tA former county in northeastern Scotland; see Aberdeenshire. ; n\tA locality in Monroe County, Arkansas. ; n\tAn unincorporated community in Inyo County, California. ; n\tA census-designated place in Florida. ; n\tA village in Georgia, United States. ; n\tA city in Idaho. ; n\tAn unincorporated community in Ohio County, Indiana. ; n\tA census-designated place in Porter County, Indiana. ; n\tAn unincorporated community in Butler County, Kentucky. ; n\tA city in eastern Maryland, home of the Aberdeen Proving Grounds. ; n\tA city, the county seat of Monroe County, Mississippi. ; n\tA town in North Carolina. ; n\tA village in Ohio. ; n\tA city, the county seat of Brown County, in northeastern South Dakota, United States. ; n\tA city in Washington. ; n\tAn unincorporated community in Lewis County, West Virginia. ; n\tA community in Nova Scotia. ; n\tA community in Ontario. ; n\tA town in Saskatchewan. ; n\tA town in Eastern Cape province, South Africa. ; n\tA town in New South Wales. ; n\tA suburb of Devonport, in northern Tasmania, Australia. ; n\tAn area and town in the Southern District, Hong Kong. ; n\t(usually capitalized) A wide evenly curved fishhook. ; n\t(usually capitalized) Alternative form of Aberdeen terrier [A breed of dog; Scottish terrier.] "},{"w":"abattoir","c":"1","s":"3","d":"n\tA public slaughterhouse for cattle, sheep, etc. ; n\tA place or event likened to a slaughterhouse, because of great carnage or bloodshed. "},{"w":"abri","c":"1","s":"2","d":"n\ta shelter; a cavity in a hillside; a shelter on the side of hill with an overhung rock as its roof "},{"w":"absence","c":"1","s":"2","d":"n\tA state of being away or withdrawn from a place or from companionship ; n\tThe period of someone being away. ; n\tFailure to be present where one is expected, wanted, or needed; nonattendance; deficiency. ; n\tLack; deficiency; nonexistence. ; n\tInattention to things present; abstraction (of mind). ; n\t(medicine) Temporary loss or disruption of consciousness, with sudden onset and recovery, and common in epilepsy. ; n\t(fencing) Lack of contact between blades. "},{"w":"abbott","c":"1","s":"2","d":"n\tA surname originating as an occupation. ; n\t(very rare) A male given name transferred from the surname. "},{"w":"abies","c":"1","s":"2","d":"n\tA tree of the genus Abies. ; n\tA tannin made from the barks of firs and spruces. "},{"w":"abb","c":"1","s":"1","d":"n\tA type of yarn for the warp. ; n\tA rough wool from the inferior parts of the fleece, used for the woof or weft. ; n\t(UK) A filling pick used in weaving. "},{"w":"abracadabra","c":"1","s":"5","d":"n\tA use of the mystical term ‘abracadabra’, supposed to work as part of a healing charm or a magical spell; any spell or incantation making use of the word. ; n\tMumbo-jumbo; obscure language or technicalities; jargon. "},{"w":"absentia","c":"1","s":"3","d":"n\tabsence "},{"w":"absinth","c":"1","s":"2","d":"n\tAlternative form of absinthe [The herb absinthium Artemisia absinthium (grande wormwood); essence of wormwood.] "},{"w":"abbe","c":"1","s":"2","d":"n\tAlternative spelling of abbé [(obsolete) A French abbot, the (male) head of an abbey.] "},{"w":"abstract","c":"1","s":"2","d":"n\tAn abridgement or summary of a longer publication. ; n\tConcentrated essence of a product. ; n\t(medicine) A powdered solid extract of a medicinal substance mixed with lactose. ; n\tAn abstraction; an abstract term; that which is abstract. ; n\tThe theoretical way of looking at things; something that exists only in idealized form. ; n\t(art) An abstract work of art. ; n\t(real estate) A summary title of the key points detailing a tract of land, for ownership; abstract of title. ; adj\t(obsolete) Derived; extracted. ; adj\t(now rare) Drawn away; removed from; apart from; separate. ; adj\tInsufficiently factual. ; adj\tApart from practice or reality; vague; theoretical; impersonal; not applied. ; adj\t(grammar) As a noun, denoting a concept or intangible as opposed to an object, place, or person. ; adj\tDifficult to understand; abstruse; hard to conceptualize. ; adj\tSeparately expressing a property or attribute of an object that is considered to be inherent to that object: attributive, ascriptive. ; adj\tPertaining comprehensively to, or representing, a class or group of objects, as opposed to any specific object; considered apart from any application to a particular object: general, generic, nonspecific; representational. ; adj\t(archaic) Absent-minded. ; adj\t(art, often capitalized) Free from representational qualities, in particular the non-representational styles of the 20ᵗʰ century. ; adj\t(music) Absolute. ; adj\t(dance) Lacking a story. ; adj\t(object-oriented programming, of a class) Being a partial basis for subclasses rather than a complete template for objects. ; v\t(transitive) To separate; to disengage. ; v\t(transitive) To remove; to take away; withdraw. ; v\t(transitive, euphemistic) To steal; to take away; to remove without permission. ; v\t(transitive) To summarize; to abridge; to epitomize. ; v\tTo conceptualize an ideal subgroup by means of the generalization of an attribute, as follows: by apprehending an attribute inherent to one individual, then separating that attribute and contemplating it by itself, then conceiving of that attribute as a general quality, then despecifying that conceived quality with respect to several or many individuals, and by then ideating a group composed of those individuals perceived to possess said quality. ; v\t(transitive, obsolete) To extract by means of distillation. ; v\t(transitive) To consider abstractly; to contemplate separately or by itself; to consider theoretically; to look at as a general quality. ; v\t(intransitive, reflexive, literally, figuratively) To withdraw oneself; to retire. ; v\t(transitive) To draw off (interest or attention). ; v\t(intransitive, rare) To perform the process of abstraction. ; v\t(intransitive, fine arts) To create abstractions. ; v\t(intransitive, computing) To produce an abstraction, usually by refactoring existing code. Generally used with \"out\". "},{"w":"absurdist","c":"1","s":"3","d":"n\tAn advocate of absurdism, in particular a writer of absurd topics. ; adj\tOf, or relating to absurdism. "},{"w":"absconding","c":"1","s":"3","d":"n\tAn instance in which someone absconds. "},{"w":"abelia","c":"1","s":"3","d":"n\tAny of the various honeysuckles of the genus Abelia. "},{"w":"abhorring","c":"1","s":"3","d":"n\tDetestation. ; n\tA detested thing. "},{"w":"ableism","c":"1","s":"4","d":"n\tDiscrimination against persons with disabilities or favour of those without. "},{"w":"abhorrence","c":"1","s":"3","d":"n\tExtreme aversion or detestation; the feeling of utter dislike or loathing. ; n\t(obsolete, historical) An expression of abhorrence, in particular any of the parliamentary addresses dictated towards Charles II. ; n\tA person or thing that is loathsome; a detested thing. "},{"w":"abyss","c":"1","s":"2","d":"n\tHell; the bottomless pit; primeval chaos; a confined subterranean ocean. ; n\t(frequently figuratively) A bottomless or unfathomed depth, gulf, or chasm; hence, any deep, immeasurable; any void space. ; n\tAnything infinite, immeasurable, or profound. ; n\tMoral depravity; vast intellectual or moral depth. ; n\t(with article) An impending catastrophic happening. ; n\t(heraldry) The center of an escutcheon. ; n\t(oceanography) The abyssal zone. ; n\t(figuratively) A difference, especially a large difference, between groups. "},{"w":"abuse","c":"1","s":"2","d":"n\tImproper treatment or usage; application to a wrong or bad purpose; an unjust, corrupt or wrongful practice or custom. ; n\tMisuse; improper use; perversion. ; n\t(obsolete) A delusion; an imposture; misrepresentation; deception. ; n\tCoarse, insulting speech; abusive language; language that unjustly or angrily vilifies. ; n\t(now rare) Catachresis. ; n\tPhysical maltreatment; injury; cruel treatment. ; n\tViolation; defilement; rape; forcing of undesired sexual activity by one person on another, often on a repeated basis. ; v\t(transitive) To put to a wrong use; to misapply; to use improperly; to misuse; to use for a wrong purpose or end; to pervert ; v\t(transitive) To injure; to maltreat; to hurt; to treat with cruelty, especially repeatedly. ; v\t(transitive) To attack with coarse language; to insult; to revile; malign; to speak in an offensive manner to or about someone; to disparage. ; v\t(transitive) To imbibe a drug for a purpose other than it was intended; to intentionally take more of a drug than was prescribed for recreational reasons; to take illegal drugs habitually. ; v\t(transitive, archaic) To violate; defile; to rape; (reflexive) to masturbate. ; v\t(transitive, obsolete) Misrepresent; adulterate. ; v\t(transitive, obsolete) To deceive; to trick; to impose on; misuse the confidence of. ; v\t(transitive, obsolete, Scotland) Disuse. "},{"w":"abduction","c":"1","s":"3","d":"n\tLeading away; a carrying away. ; n\t(anatomy) The act of abducing or abducting; a drawing apart; the movement which separates a limb or other part from the axis, or middle line, of the body. ; n\t(logic) A syllogism or form of argument in which the major premise is evident, but the minor is only probable. ; n\t(law) The wrongful, and usually forcible, carrying off of a human being. "},{"w":"abaca","c":"1","s":"3","d":"n\tMusa textilis, a species of banana tree native to the Philippines grown for its textile, rope- and papermaking fibre. ; n\t(uncountable) The fiber of this plant, used in rope. "},{"w":"abettor","c":"1","s":"3","d":"n\tOne that abets an offender; one that incites; instigates; encourages. ; n\tA supporter or advocate. "},{"w":"abductor","c":"1","s":"3","d":"n\tOne who abducts; a kidnapper. ; n\t(anatomy) A muscle which serves to draw a part out, or from the median line of the body "},{"w":"absolutist","c":"1","s":"4","d":"n\tOne who is in favor of an absolute or autocratic government. ; n\t(metaphysics) One who believes that it is possible to realize a cognition or concept of the Absolute. ; n\tAn uncompromising person; one who maintains certain principles to be absolute. ; adj\tOf or pertaining to absolutism; arbitrary; despotic; uncompromising. "},{"w":"aborigines","c":"1","s":"5","d":"n\toriginal inhabitants, natives. ; n\t(Roman mythology) The earliest inhabitants of central Italy, from whom the Latins were said to have descended. ; n\tThe native peoples of various regions, especially the Australian Aboriginal peoples, but also the original inhabitants of Canada and Argentina. Often considered offensive. ; n\tThe original people of a location, originally Greek and Roman. ; n\tIndigenous flora and fauna. ; n\t(historical) The inhabitants of a location before colonization by the Europeans occurred. "},{"w":"abecedarian","c":"1","s":"6","d":"n\tSomeone who is learning the alphabet. ; n\tAn elementary student, a novice; one in the early steps of learning. ; n\t(archaic) Someone engaged in teaching the alphabet; an elementary teacher; one that teaches the methods and principles of learning. ; n\t(rhetoric) A work which uses words or lines in alphabetical order. ; adj\t(now rare) Pertaining to someone learning the alphabet or basic studies; elementary; rudimentary. ; adj\tPertaining to the alphabet, or several alphabets. ; adj\tArranged in an alphabetical manner. ; adj\tRelating to or resembling an abecedarius. ; n\t(historical) A member of a 16th-century Anabaptist sect, follower of the Zwickau prophets (and specially of Thomas Storch), who believed that any kind of knowledge (even basic reading and writing) would keep one from reaching obtaining salvation. "},{"w":"abstinence","c":"1","s":"3","d":"n\tSpecifically, the practice of abstaining from intoxicating/alcoholic beverages; total abstinence; teetotalism). ; n\tSpecifically, the practice of abstaining from sexual intercourse, either permanently or until marriage. ; n\t(ecclesiastical) Abstention from certain foods on days of penitential observance. ; n\tThe practice of self-denial; self-restraint; forebearance from anything. ; n\t(obsolete) Self-denial; abstaining; or forebearance of anything. ; n\t(business) Delay of spending to accrue capital. "},{"w":"aberrance","c":"1","s":"3","d":"n\tState of being aberrant; a wandering from the right way; deviation from truth, rectitude. "},{"w":"abaya","c":"1","s":"3","d":"n\tSynonym of aba ; n\tA surname from Tagalog. "},{"w":"abandonment","c":"1","s":"4","d":"n\tThe act of abandoning, or the state of being abandoned; total desertion; relinquishment. ; n\tThe voluntary leaving of a person to whom one is bound by a special relation, as a wife, husband or child; desertion. ; n\tAn abandoned building or structure. ; n\t(law) The relinquishment of a right, claim, or privilege; relinquishment of right to secure a patent by an inventor; relinquishment of copyright by an author. ; n\t(law) The relinquishment by the insured to the underwriters of what may remain of the property insured after a loss or damage by a peril insured against. ; n\tThe cessation of service on a particular segment of the lines of a common carrier, as granted by a government agency. ; n\tA refusal to receive freight so damaged in transit as to be worthless and render carrier liable for its value. ; n\tThe self-surrender to an outside influence. ; n\tAbandon; careless freedom or ease; surrender to one\u0027s emotions. "},{"w":"abasement","c":"1","s":"3","d":"n\tThe act of abasing, humbling, or bringing low. ; n\tThe state of being abased or humbled; humiliation. "},{"w":"abatement","c":"1","s":"3","d":"n\tThe act of abating, or the state of being abated; a lessening, diminution, or reduction; a moderation; removal or putting an end to; the suppression. ; n\t(law) The action of a person that abates, or without proper authority enters a residence after the death of the owner and before the heir takes possession. ; n\t(law) The reduction of the proceeds of a will, when the debts have not yet been satisfied; the reduction of taxes due. ; n\tAn amount abated; that which is taken away by way of reduction; deduction; decrease; a rebate or discount allowed; in particular from a tax. ; n\t(heraldry) A mark of dishonor on an escutcheon; any figure added to the coat of arms tending to lower the dignity or station of the bearer. ; n\t(Scotland) Waste of stuff in preparing to size. "},{"w":"abidance","c":"1","s":"3","d":"n\tThe act of abiding or continuing; abode; stay; continuance; dwelling. ; n\tAdherence; compliance; conformity. "},{"w":"abolition","c":"1","s":"4","d":"n\tThe act of abolishing; an annulling; abrogation. ; n\tThe state of being abolished. ; n\t(historical, often capitalised, UK, US) The ending of the slave trade or of slavery. ; n\t(historical, often capitalised, Australia) The ending of convict transportation. ; n\t(obsolete) An amnesty; a putting out of memory. "},{"w":"abrasion","c":"1","s":"3","d":"n\tThe act of abrading, wearing, or rubbing off; the wearing away by friction. ; n\t(obsolete) The substance thus rubbed off; debris. ; n\t(geology) The effect of mechanical erosion of rock, especially a river bed, by rock fragments scratching and scraping it. ; n\tAn abraded, scraped, or worn area. ; n\t(medicine) A superficial wound caused by scraping; an area of skin where the cells on the surface have been scraped or worn away. ; n\t(dentistry) The wearing away of the surface of the tooth by chewing. "},{"w":"abrogation","c":"1","s":"4","d":"n\tThe act of abrogating; a repeal by authority; abolition. "},{"w":"abetting","c":"1","s":"3","d":"n\tThe act of one who abets. "},{"w":"aberration","c":"1","s":"4","d":"n\tThe act of wandering; deviation from truth, moral rectitude; abnormal; divergence from the straight, correct, proper, normal, or from the natural state. ; n\t(optics) The convergence to different foci, by a lens or mirror, of rays of light emanating from one and the same point, or the deviation of such rays from a single focus; a defect in a focusing mechanism that prevents the intended focal point. ; n\t(astronomy) A small periodical change of the apparent positions of the stars and other heavenly bodies, due to the combined effect of the motion of light and the motion of the observer. ; n\t(astronomy, by extension) The tendency of light rays to preferentially strike the leading face of a moving object (the effect underlying the above phenomenon). ; n\tA partial alienation of reason. ; n\tA mental disorder, especially one of a minor or temporary character. ; n\t(zoology, botany) A typical development or structure; deviation from the normal type; an aberrant organ. ; n\t(medicine) A deviation of a tissue, organ or mental functions from what is considered to be within the normal range. ; n\t(electronics) A defect in an image produced by an optical or electrostatic lens system. "},{"w":"abscission","c":"1","s":"3","d":"n\tThe act or process of cutting off. ; n\t(obsolete) The state of being cut off. ; n\t(rhetoric) A figure of speech employed when a speaker having begun to say a thing stops abruptly ; n\t(botany) The natural separation of a part at a predetermined location, such as a leaf at the base of the petiole. "},{"w":"abuja","c":"1","s":"3","d":"n\tThe capital city of Nigeria; lying in the Federal Capital Territory in the North Central geopolitical zone. "},{"w":"abaddon","c":"1","s":"3","d":"n\tThe destroyer, or angel of the bottomless pit; Apollyon; ; n\t(poetic) Hell; the bottomless pit; a place of destruction. ; n\t(archaic, British slang) An informer; a criminal who informs on other criminals to the authorities. "},{"w":"abbacy","c":"1","s":"3","d":"n\tThe dignity, estate, term, or jurisdiction of an abbot or abbess. "},{"w":"absinthe","c":"1","s":"2","d":"n\tThe herb absinthium Artemisia absinthium (grande wormwood); essence of wormwood. ; n\t(figuratively) Bitterness; sorrow. ; n\tA distilled, highly alcoholic, anise-flavored liquor originally made from grande wormwood, anise, and other herbs. ; n\t(color) A moderate yellow green. ; n\tabsinthe green: ; n\t(US) Sagebrush. "},{"w":"abbey","c":"1","s":"2","d":"n\tThe office or dominion of an abbot or abbess. ; n\tA monastery or society of people, secluded from the world and devoted to religion and celibacy, which is headed by an abbot or abbess; also, the monastic building or buildings. ; n\tThe church of a monastery. ; n\t(British) A residence that was previously an abbatial building. ; n\tA diminutive of the female given name Abigail, from Hebrew. ; n\tA diminutive of the male given name Albert, from the Germanic languages. ; n\tA British surname. ; n\t(London) Westminster Abbey. ; n\t(Scotland) The precincts of the Abbey of Holyrood. "},{"w":"abutment","c":"1","s":"3","d":"n\tThe point of junction between two things, in particular a support, that abuts. ; n\t(engineering, architecture) The solid portion of a structure that supports the lateral pressure of an arch or vault. ; n\t(engineering) A construction that supports the ends of a bridge; a structure that anchors the cables on a suspension bridge. ; n\t(meteorology) The part of a valley or canyon wall against which a dam is constructed. ; n\tSomething that abuts, or on which something abuts. ; n\tThe state of abutting. ; n\t(architecture) That element that shares a common boundary or surface with its neighbor. ; n\t(dentistry) The tooth that supports a denture or bridge. ; n\tA fixed point or surface where resistance is obtained. "},{"w":"abseiling","c":"1","s":"3","d":"n\tThe process or act of abseiling. "},{"w":"abrasiveness","c":"1","s":"4","d":"n\tThe property, quality or instance of being abrasive. "},{"w":"abbreviation","c":"1","s":"5","d":"n\tThe result of shortening or reducing; abridgment. ; n\t(linguistics) A shortened or contracted form of a word or phrase, used to represent the whole, utilizing omission of letters, and sometimes substitution of letters, or duplication of initial letters to signify plurality, including signs such as +, =, @. ; n\tThe process of abbreviating. ; n\t(music) A notation used in music score to denote a direction, as pp or mf. ; n\t(music) One or more dashes through the stem of a note, dividing it respectively into quavers, semiquavers, demisemiquavers, or hemidemisemiquavers. ; n\tAny convenient short form used as a substitution for an understood or inferred whole. ; n\t(biology) Loss during evolution of the final stages of the ancestral ontogenetic pattern. ; n\t(mathematics) Reduction to lower terms, as a fraction. "},{"w":"abbreviations","c":"1","s":"5","d":"n\tThe result of shortening or reducing; abridgment. ; n\t(linguistics) A shortened or contracted form of a word or phrase, used to represent the whole, utilizing omission of letters, and sometimes substitution of letters, or duplication of initial letters to signify plurality, including signs such as +, =, @. ; n\tThe process of abbreviating. ; n\t(music) A notation used in music score to denote a direction, as pp or mf. ; n\t(music) One or more dashes through the stem of a note, dividing it respectively into quavers, semiquavers, demisemiquavers, or hemidemisemiquavers. ; n\tAny convenient short form used as a substitution for an understood or inferred whole. ; n\t(biology) Loss during evolution of the final stages of the ancestral ontogenetic pattern. ; n\t(mathematics) Reduction to lower terms, as a fraction. "},{"w":"absenteeism","c":"1","s":"5","d":"n\tThe state of being absent, especially frequently or without good reason; the practice of an absentee. ; n\tThe practice of absenting oneself from the country or district where one\u0027s estate is situated. "},{"w":"abnormality","c":"1","s":"5","d":"n\tThe state or quality of being abnormal; variation; irregularity. ; n\tSomething abnormal; an aberration; an abnormal occurrence or feature. "},{"w":"abbot","c":"1","s":"2","d":"n\tThe superior or head of an abbey or monastery. ; n\tThe pastor or administrator of an order, including minor and major orders starting with the minor order of porter. ; n\tA layman who received the abbey\u0027s revenues, after the closing of the monasteries. ; n\t(archaic, British slang) A brothel-owner\u0027s husband or lover. ; n\t(archaic, British slang) A ponce; a man employed by a prostitute to find clients, and who may also act as a bodyguard or equivalent to a bouncer. ; n\tA surname. "},{"w":"absalom","c":"1","s":"3","d":"n\tThe third son of David, king of Israel. ; n\t(rare) A male given name from Hebrew. "},{"w":"abele","c":"1","s":"2","d":"n\tThe white poplar (Populus alba). "},{"w":"aby","c":"1","s":"2","d":"v\t(archaic) To pay the penalty for (something); to atone for, to make amends. ; v\t(archaic, figuratively) To pay (something) as a penalty; to suffer (something). ; v\t(obsolete except Scotland) To endure or tolerate (something); to experience. ; v\t(obsolete) To pay for (something); to buy. ; v\tTo pay the penalty; to atone. ; v\tTo endure; to remain. ; n\tA village in Aby with Greenfield parish, East Lindsey district, Lincolnshire, England (OS grid ref TL4178). ; n\tA village in south-eastern Ivory Coast. "},{"w":"absquatulate","c":"1","s":"4","d":"v\t(intransitive, slang) To leave quickly or in a hurry; to depart, flee. ; v\t(intransitive, slang) to abscond. "},{"w":"abound","c":"1","s":"2","d":"v\t(intransitive) To be full to overflowing. ; v\t(intransitive, obsolete) To be wealthy. ; v\t(intransitive) To be highly productive. ; v\t(intransitive) To be present or available in large numbers or quantities; to be plentiful. ; v\t(intransitive) To revel in. ; v\t(intransitive) To be copiously supplied "},{"w":"abseil","c":"1","s":"2","d":"v\t(intransitive) To descend a steep or vertical drop using a rope with a mechanical friction device or (classic abseil) by wrapping the rope around the body; to rappel. ; n\tA descent in mountaineering using a rope looped at the top and a friction device. "},{"w":"aberrate","c":"1","s":"3","d":"v\t(intransitive) To go astray; to diverge; to deviate (from); deviate from. ; v\t(transitive) To distort; to cause aberration of. "},{"w":"abut","c":"1","s":"2","d":"v\t(intransitive) To touch by means of a mutual border, edge or end; to border on; to lie adjacent (to); to be contiguous (said of an area of land) ; v\t(transitive) To border upon; be next to; abut on; be adjacent to. ; v\t(intransitive) To lean against on one end; to end on, of a part of a building or wall. "},{"w":"abuts","c":"1","s":"2","d":"v\t(intransitive) To touch by means of a mutual border, edge or end; to border on; to lie adjacent (to); to be contiguous (said of an area of land) ; v\t(transitive) To border upon; be next to; abut on; be adjacent to. ; v\t(intransitive) To lean against on one end; to end on, of a part of a building or wall. "},{"w":"abscond","c":"1","s":"2","d":"v\t(law) To hide, conceal, or absent oneself clandestinely, with the intent to avoid legal process ; v\t(intransitive, of bee colonies) To abandon a hive. ; v\t(intransitive) To hide, to be in hiding or concealment. ; v\t(intransitive, uncommon) To withdraw. ; v\t(transitive, uncommon) To evade, to hide or flee from. ; v\t(obsolete, transitive) To conceal; to take away. "},{"w":"absconded","c":"1","s":"3","d":"v\t(law) To hide, conceal, or absent oneself clandestinely, with the intent to avoid legal process ; v\t(intransitive, of bee colonies) To abandon a hive. ; v\t(intransitive) To hide, to be in hiding or concealment. ; v\t(intransitive, uncommon) To withdraw. ; v\t(transitive, uncommon) To evade, to hide or flee from. ; v\t(obsolete, transitive) To conceal; to take away. "},{"w":"abbreviate","c":"1","s":"4","d":"v\t(obsolete, transitive) To shorten by omitting parts or details. ; v\t(obsolete, intransitive) To speak or write in a brief manner. ; v\t(transitive) To make shorter; to shorten (in time); to abridge; to shorten by ending sooner than planned. ; v\t(transitive) To reduce a word or phrase by means of contraction or omission to a shorter recognizable form. ; v\t(transitive, mathematics) To reduce to lower terms, as a fraction. ; adj\t(obsolete) Abbreviated; abridged; shortened. ; adj\t(biology) Having one part relatively shorter than another or than the ordinary type. ; n\t(obsolete, Scotland) An abridgment. "},{"w":"abjugate","c":"1","s":"3","d":"v\t(obsolete, transitive) To unyoke; set free; uncouple. "},{"w":"abet","c":"1","s":"2","d":"v\t(obsolete, transitive) To urge on, stimulate (a person to do) something desirable. ; v\t(transitive) To incite; to assist or encourage by aid or countenance in crime. ; v\t(transitive, archaic) To support, countenance, maintain, uphold, or aid (any good cause, opinion, or action); to maintain. ; v\t(obsolete) To back up one\u0027s forecast of a doubtful issue, by staking money, etc., to bet. ; n\t(obsolete) Fraud or cunning. ; n\t(obsolete) An act of abetting; of helping; of giving aid. "},{"w":"abetted","c":"1","s":"3","d":"v\t(obsolete, transitive) To urge on, stimulate (a person to do) something desirable. ; v\t(transitive) To incite; to assist or encourage by aid or countenance in crime. ; v\t(transitive, archaic) To support, countenance, maintain, uphold, or aid (any good cause, opinion, or action); to maintain. ; v\t(obsolete) To back up one\u0027s forecast of a doubtful issue, by staking money, etc., to bet. ; n\t(obsolete) Fraud or cunning. ; n\t(obsolete) An act of abetting; of helping; of giving aid. "},{"w":"abare","c":"1","s":"3","d":"v\t(obsolete) to strip, uncover (make bare) ; n\tA surname from French. "},{"w":"ablactate","c":"1","s":"3","d":"v\t(rare) To wean. "},{"w":"absterge","c":"1","s":"2","d":"v\t(transitive, archaic, now rare) To make clean by wiping; to wipe away. "},{"w":"abscind","c":"1","s":"2","d":"v\t(transitive, archaic) To cut off. "},{"w":"abridge","c":"1","s":"2","d":"v\t(transitive, archaic) To deprive; to cut off. ; v\t(transitive, archaic, rare) To debar from. ; v\t(transitive) To make shorter; to shorten in duration or extent. ; v\t(transitive) To shorten or contract by using fewer words, yet retaining the sense; to epitomize; to condense. ; v\t(transitive) Cut short; truncate. ; v\t(transitive) To curtail. ; n\tA village in Essex, England "},{"w":"abrogate","c":"1","s":"3","d":"v\t(transitive, law) To annul by an authoritative act; to abolish by the authority of the maker or her or his successor; to repeal; — applied to the repeal of laws, decrees, ordinances, the abolition of customs, etc. ; v\t(transitive) To put an end to; to do away with. ; v\t(molecular biology, transitive) To block a process or function. ; adj\t(archaic) Abrogated; abolished. "},{"w":"abrogated","c":"1","s":"4","d":"v\t(transitive, law) To annul by an authoritative act; to abolish by the authority of the maker or her or his successor; to repeal; — applied to the repeal of laws, decrees, ordinances, the abolition of customs, etc. ; v\t(transitive) To put an end to; to do away with. ; v\t(molecular biology, transitive) To block a process or function. ; adj\t(archaic) Abrogated; abolished. "},{"w":"abrogating","c":"1","s":"4","d":"v\t(transitive, law) To annul by an authoritative act; to abolish by the authority of the maker or her or his successor; to repeal; — applied to the repeal of laws, decrees, ordinances, the abolition of customs, etc. ; v\t(transitive) To put an end to; to do away with. ; v\t(molecular biology, transitive) To block a process or function. ; adj\t(archaic) Abrogated; abolished. "},{"w":"abdicate","c":"1","s":"3","d":"v\t(transitive, obsolete) To disclaim and expel from the family, as a father his child; to disown; to disinherit. ; v\t(transitive, reflexive, obsolete) To formally separate oneself from or to divest oneself of. ; v\t(transitive, obsolete) To depose. ; v\t(transitive, obsolete) To reject; to cast off; to discard. ; v\t(transitive) To surrender, renounce or relinquish, as sovereign power; to withdraw definitely from filling or exercising, as a high office, station, dignity; to fail to fulfill responsibility for. ; v\t(intransitive) To relinquish or renounce a throne, or other high office or dignity; to renounce sovereignty. "},{"w":"abroach","c":"1","s":"2","d":"v\t(transitive, obsolete) To set abroach; to let out, as liquor; to broach; to tap. ; adv\t(obsolete) Broached; in a condition for letting out or yielding liquor, as a cask which is tapped. ; adv\t(obsolete) In a state to be diffused or propagated. ; adj\tTapped; broached. ; adj\tAstir; moving about. "},{"w":"abraid","c":"1","s":"2","d":"v\t(transitive, obsolete) To wrench (something) out. ; v\t(intransitive, obsolete) To wake up. ; v\t(intransitive, archaic) To spring, start, make a sudden movement. ; v\t(intransitive, transitive, obsolete) To shout out. ; v\t(transitive, obsolete) To rise in the stomach with nausea. ; adv\tAlternative form of abread [(UK dialectal, chiefly Scotland) Abroad.] "},{"w":"abacinate","c":"1","s":"4","d":"v\t(transitive, rare) To blind by holding a red-hot metal rod or plate before the eyes "},{"w":"abstain","c":"1","s":"2","d":"v\t(transitive, reflexive, obsolete) Keep or withhold oneself. ; v\t(intransitive) Refrain from (something or doing something); keep from doing, especially an indulgence. ; v\t(intransitive, obsolete) Fast (not eat for a period). ; v\t(intransitive) Deliberately refrain from casting one\u0027s vote at a meeting where one is present. ; v\t(transitive, obsolete) Hinder; keep back; withhold. "},{"w":"abscise","c":"1","s":"2","d":"v\t(transitive) To cut off. ; v\t(intransitive, botany) To separate by means of abscission; to shed or drop off. "},{"w":"abnegate","c":"1","s":"3","d":"v\t(transitive) To deny (oneself something); to renounce or give up (a right, a power, a claim, a privilege, a convenience). ; v\t(transitive) To relinquish; to surrender; to abjure. "},{"w":"abide","c":"1","s":"2","d":"v\t(transitive) To endure without yielding; to withstand. ; v\t(transitive) To bear patiently. ; v\t(transitive) To pay for; to stand the consequences of. ; v\tUsed in a phrasal verb: abide by (“to accept and act in accordance with”). ; v\t(intransitive, obsolete) To wait in expectation. ; v\t(intransitive, obsolete) To pause; to delay. ; v\t(intransitive, archaic, Scotland) To stay; to continue in a place; to remain stable or fixed in some state or condition; to be left. ; v\t(intransitive, archaic) To have one\u0027s abode. ; v\t(intransitive, archaic) To endure; to remain; to last. ; v\t(transitive, archaic) To stand ready for; to await for someone; watch for. ; v\t(transitive, obsolete) To endure or undergo a hard trial or a task; to stand up under. ; v\t(transitive, archaic) To await submissively; accept without question; submit to. "},{"w":"abides","c":"1","s":"2","d":"v\t(transitive) To endure without yielding; to withstand. ; v\t(transitive) To bear patiently. ; v\t(transitive) To pay for; to stand the consequences of. ; v\tUsed in a phrasal verb: abide by (“to accept and act in accordance with”). ; v\t(intransitive, obsolete) To wait in expectation. ; v\t(intransitive, obsolete) To pause; to delay. ; v\t(intransitive, archaic, Scotland) To stay; to continue in a place; to remain stable or fixed in some state or condition; to be left. ; v\t(intransitive, archaic) To have one\u0027s abode. ; v\t(intransitive, archaic) To endure; to remain; to last. ; v\t(transitive, archaic) To stand ready for; to await for someone; watch for. ; v\t(transitive, obsolete) To endure or undergo a hard trial or a task; to stand up under. ; v\t(transitive, archaic) To await submissively; accept without question; submit to. "},{"w":"abandon","c":"1","s":"3","d":"v\t(transitive) To give up or relinquish control of, to surrender or to give oneself over, or to yield to one\u0027s emotions. ; v\t(transitive) To desist in doing, practicing, following, holding, or adhering to; to turn away from; to permit to lapse; to renounce; to discontinue. ; v\t(transitive) To leave behind; to desert, as in a ship, a position, or a person, typically in response to overwhelming odds or impending dangers; to forsake, in spite of a duty or responsibility. ; v\t(transitive, obsolete) To subdue; to take control of. ; v\t(transitive, obsolete) To cast out; to banish; to expel; to reject. ; v\t(transitive) To no longer exercise a right, title, or interest, especially with no interest of reclaiming it again; to yield; to relinquish. ; v\t(transitive) To surrender to the insurer (an insured item), so as to claim a total loss. ; n\tA yielding to natural impulses or inhibitions; freedom from artificial constraint, with loss of appreciation of consequences. ; n\t(obsolete) abandonment; relinquishment. "},{"w":"absorb","c":"1","s":"2","d":"v\t(transitive) To include so that it no longer has separate existence; to overwhelm; to cause to disappear as if by swallowing up; to incorporate; to assimilate; to take in and use up. ; v\t(transitive, obsolete) To engulf, as in water; to swallow up. ; v\t(transitive) To suck up; to drink in; to imbibe, like a sponge or as the lacteals of the body; to chemically take in. ; v\t(transitive, physics) in receiving a physical impact or vibration without recoil. ; v\t(transitive, physics) in receiving sound energy without repercussion or echo. ; v\t(transitive, physics) taking in radiant energy and converting it to a different form of energy, like heat. ; v\t(transitive) To engross or engage wholly; to occupy fully. ; v\t(transitive) To occupy or consume time. ; v\t(transitive) Assimilate mentally. ; v\t(transitive, business) To assume or pay for as part of a commercial transaction. ; v\t(transitive) To defray the costs. ; v\t(transitive) To accept or purchase in quantity. "},{"w":"abase","c":"1","s":"2","d":"v\t(transitive) To lower, as in condition in life, office, rank, etc., so as to cause pain or hurt feelings; to degrade, to depress, to humble, to humiliate. ; v\t(transitive, archaic) To lower physically; to depress; to cast or throw down; to stoop. ; v\t(transitive, obsolete) To lower in value, in particular by altering the content of alloys in coins; to debase. "},{"w":"abash","c":"1","s":"2","d":"v\t(transitive) To make ashamed; to embarrass; to destroy the self-possession of, as by exciting suddenly a consciousness of guilt, mistake, or inferiority; to disconcert; to discomfit. ; v\t(intransitive, obsolete) To lose self-possession; to become ashamed. "},{"w":"abhor","c":"1","s":"2","d":"v\t(transitive) To regard (someone or something) as horrifying or detestable; to feel great repugnance toward. ; v\t(transitive, obsolete, impersonal) To fill with horror or disgust. ; v\t(transitive) To turn aside or avoid; to keep away from; to reject. ; v\t(transitive, canon law, obsolete) To protest against; to reject solemnly. ; v\t(intransitive, obsolete) To feel horror, disgust, or dislike (towards); to be contrary or averse (to); construed with from. ; v\t(intransitive, obsolete) Differ entirely from. "},{"w":"ablate","c":"1","s":"2","d":"v\t(transitive) To remove or decrease something by cutting, erosion, melting, evaporation, or vaporization. ; v\t(intransitive) To undergo ablation; to become melted or evaporated and removed at a high temperature. "},{"w":"abjure","c":"1","s":"2","d":"v\t(transitive) To renounce upon oath; to forswear; to disavow. ; v\t(transitive, obsolete, historical) To cause one to renounce or recant. ; v\t(transitive) To reject with solemnity; to abandon forever; to repudiate; to disclaim. ; v\t(transitive) To abstain from; to avoid; to shun. "},{"w":"abrade","c":"1","s":"2","d":"v\t(transitive) To rub or wear off; erode. ; v\t(transitive) To wear down or exhaust, as a person; irritate. ; v\t(transitive) To irritate by rubbing; chafe. ; v\t(transitive) To cause the surface to become more rough. ; v\t(intransitive) To undergo abrasion. ; v\t(transitive) Obsolete spelling of abraid [(transitive, obsolete) To wrench (something) out.] "},{"w":"absolve","c":"1","s":"2","d":"v\t(transitive) To set free, release or discharge (from obligations, debts, responsibility etc.). ; v\t(transitive, obsolete) To resolve; to explain; to solve. ; v\t(transitive) To pronounce free from or give absolution for a penalty, blame, or guilt. ; v\t(transitive, law) To pronounce not guilty; to grant a pardon for. ; v\t(transitive, theology) To grant a remission of sin; to give absolution to. ; v\t(transitive, theology) To remit a sin; to give absolution for a sin. ; v\t(transitive, obsolete) To finish; to accomplish. ; v\t(transitive) To pass a course or test; to gain credit for a class; to qualify academically. "},{"w":"abduct","c":"1","s":"2","d":"v\t(transitive) To take away by force; to carry away (a human being) wrongfully and usually with violence or deception; to kidnap. ; v\t(transitive, anatomy) To draw away, as a limb or other part, from the median axis of the body. "},{"w":"abolish","c":"1","s":"3","d":"v\tTo end a law, system, institution, custom or practice. ; v\t(archaic) To put an end to or destroy, as a physical object; to wipe out. "},{"w":"abate","c":"1","s":"2","d":"v\tTo lessen (something) in force or intensity; to moderate. ; v\tTo reduce (something) in amount or size. ; v\tTo lower (something) in price or value. ; v\t(archaic) ; v\t(law) ; v\t(obsolete) ; v\tTo decrease in force or intensity; to subside. ; v\tTo decrease in amount or size. ; v\tTo lower in price or value; (law) specifically, of a bequest in a will: to lower in value because the testator\u0027s estate is insufficient to satisfy all the bequests in full. ; v\t(archaic, chiefly figuratively) Of an edge, point, etc.: to become blunt or dull. ; n\t(law) ; n\t(obsolete) ; n\t(uncountable) Abatement; reduction; (countable) an instance of this. ; n\t(uncountable) Deduction; subtraction; (countable) an instance of this. ; v\t(transitive, intransitive, law, chiefly historical) To enter upon and unlawfully seize (land) after the owner has died, thus preventing an heir from taking possession of it. ; n\tAn Italian abbot or other member of the clergy. ; n\tA surname from Italian. "}]
