[{"w":"ab initio","c":"1","s":"5","d":"adv\t(law) From the time when a law, legal right or decree, contract, ownership interest, partnership (etc.) comes into force. ; adv\t(sciences) Calculated from first principles, i.e. from basic laws without any further additional assumptions. ; adv\t(of an academic course) Taken with no prior qualifications. "},{"w":"abaca","c":"1","s":"3","d":"n\tMusa textilis, a species of banana tree native to the Philippines grown for its textile, rope- and papermaking fibre. ; n\t(uncountable) The fiber of this plant, used in rope. "},{"w":"abaci","c":"1","s":"3","d":"n\t(historical, obsolete) A table or tray scattered with sand which was used for calculating or drawing. ; n\tA device used for performing arithmetical calculations; (rare) a table on which loose counters are placed, or (more commonly) an instrument with beads sliding on rods, or counters in grooves, with one row of beads or counters representing units, the next tens, etc. ; n\t(architecture) The uppermost portion of the capital of a column immediately under the architrave, in some cases a flat oblong or square slab, in others more decorated. ; n\t(Ancient Greece, Ancient Rome, historical) A board, tray, or table, divided into perforated compartments for holding bottles, cups, or the like; a kind of buffet, cupboard, or sideboard. "},{"w":"abacinate","c":"1","s":"4","d":"v\t(transitive, rare) To blind by holding a red-hot metal rod or plate before the eyes "},{"w":"abaddon","c":"1","s":"3","d":"n\tThe destroyer, or angel of the bottomless pit; Apollyon; ; n\t(poetic) Hell; the bottomless pit; a place of destruction. ; n\t(archaic, British slang) An informer; a criminal who informs on other criminals to the authorities. "},{"w":"abare","c":"1","s":"3","d":"v\t(obsolete) to strip, uncover (make bare) ; n\tA surname from French. "},{"w":"abarticulation","c":"1","s":"6","d":"n\t(anatomy) An articulation, especially one that permits free motion in the joint; a hinge joint. ; n\tThe act of dislocating a joint. ; n\t(anatomy) A term sometimes used for diarthrosis, and also for synarthrosis. Also called dearticulation. "},{"w":"abased","c":"1","s":"2","d":"adj\tHumbled; lowered, especially in rank, position, or prestige. ; adj\t(heraldry) Borne lower than usual, as a fess; also, having the ends of the wings turned downward towards the point of the shield. "},{"w":"abasia","c":"1","s":"3","d":"n\t(medicine) An inability to walk due to a defect in muscular coordination. "},{"w":"abating","c":"1","s":"3","d":"n\t(rhetoric) Anesis. "},{"w":"abatis","c":"1","s":"3","d":"n\tA means of defense formed by felled trees, or sometimes by bent trees, the ends of whose branches are sharpened and directed outwards, or against the enemy, and more recently fortified with barbed wire. ; n\t(historical) In the Middle Ages, an officer of the stables who had the care of measuring out the provender; an avenor. ; n\tIn coal-mining, walls of cord-wood piled up crosswise to keep the underground roads open so as to secure ventilation. "},{"w":"abator","c":"1","s":"3","d":"n\t(law) a person who, without right, enters into a freehold on the death of the last possessor, before the heir or devisee ; n\t(law) one who abates, ends, or does away with a nuisance "},{"w":"abaya","c":"1","s":"3","d":"n\tSynonym of aba ; n\tA surname from Tagalog. "},{"w":"abb","c":"1","s":"1","d":"n\tA type of yarn for the warp. ; n\tA rough wool from the inferior parts of the fleece, used for the woof or weft. ; n\t(UK) A filling pick used in weaving. "},{"w":"abbacy","c":"1","s":"3","d":"n\tThe dignity, estate, term, or jurisdiction of an abbot or abbess. "},{"w":"abbas","c":"1","s":"2","d":"n\tA male given name from Arabic ; n\tA surname from Arabic. "},{"w":"abbe","c":"1","s":"2","d":"n\tAlternative spelling of abbé [(obsolete) A French abbot, the (male) head of an abbey.] "},{"w":"abbess","c":"1","s":"2","d":"n\tA female superior or governess of a nunnery, or convent of nuns, having the same authority over the nuns which the abbots have over the monks. ; n\t(archaic, British slang) A woman who runs a brothel; a woman employed by a prostitute to find clients. "},{"w":"abbott","c":"1","s":"2","d":"n\tA surname originating as an occupation. ; n\t(very rare) A male given name transferred from the surname. "},{"w":"abbreviated","c":"1","s":"5","d":"adj\tShortened; made briefer. ; adj\tRelatively short; shorter than normal, or compared to others. ; adj\tScanty, as in clothing. "},{"w":"abby","c":"1","s":"2","d":"n\tA diminutive of the female given name Abigail, from Hebrew, also used as a formal given name. ; n\tA diminutive of the male given name Albert, from the Germanic languages ; n\tObsolete spelling of abbey [The office or dominion of an abbot or abbess.] "},{"w":"abc","c":"1","s":"3","d":"n\t(uncountable, countable, usually plural in Canada, US) The English alphabet. ; n\t(obsolete, poetry) A type of poem in which the lines start with the letters of the alphabet in order. ; n\t(obsolete) A primer for teaching the Latin alphabet and first elements of reading. ; n\tThe fundamentals of any subject. ; n\t(poker) A straightforward, uniform playing style, often focusing on betting for value, folding weak hands, and avoiding bluffing. ; n\t(UK, rail transport) A British alphabetized guidebook listing trains and their stations. ; n\t(computer languages) An imperative general-purpose programming language, intended for teaching or prototyping. ; n\t(mnemonic, emergency medicine) Initialism of airway, breathing and circulation: the essential steps in the immediate assessment and treatment of critically ill or injured patients. [(anatomy) The trachea.] ; n\t(US) Initialism of alcoholic beverage control. ; n\tInitialism of American-born Chinese. ; n\tInitialism of Australian-born Chinese. ; n\t(business management) Initialism of activity-based costing. ; n\t(climbing) Initialism of advance base camp. ; n\t(biochemistry) Initialism of ATP-binding cassette. ; n\t(computing) Initialism of Atanasoff-Berry computer. ; n\t(immunology, medicine) Initialism of antigen-binding capacity. ; n\t(medicine) Initialism of aneurysmal bone cyst. ; n\t(medicine) Initialism of adenoid basal cell carcinoma. ; n\t(pharmacology) Abbreviation of abacavir. [(pharmacology) An antiretroviral drug (trademark Ziagen) taken orally in the form of its sulfate (C₁₄H₁₈N₆O)₂·H₂SO₄ in combination with other antiretroviral drugs to treat HIV infections. It is a synthetic nucleoside analog that acts by inhibiting reverse transcriptase. It causes potentially serious hypersensitivity reactions in a small percentage of patients.] ; n\t(law, finance) Initialism of assignment for the benefit of creditors. ; n\t(electrical engineering) Initialism of absorbing boundary condition. ; n\t(object-oriented programming) Initialism of abstract base class. ; n\t(psychology) Initialism of adventure-based counseling. ; n\t(psychology) Initialism of Affect, Behavior, and Cognition. ; n\t(cryptozoology) Initialism of alien big cat. ; n\t(automotive) Initialism of active body control. ; n\t(Christianity, informal) Initialism of Archbishop of Canterbury. ; n\t(television) Initialism of American Broadcasting Company: an American commercial broadcast television network founded in 1943. ; n\t(radio, television) Initialism of Australian Broadcasting Corporation. ; n\t(historical, radio) Initialism of Australian Broadcasting Company. ; n\t(historical, radio, television) Initialism of Australian Broadcasting Commission. ; n\t(radio, television) Initialism of Asahi Broadcasting Corporation. ; n\t(finance) Initialism of Agricultural Bank of China. ; n\t(publishing) Initialism of Audit Bureau of Circulations. ; n\t(UK, historical) Initialism of Aerated Bread Company; also A.B.C. ; n\t(aviation) Initialism of Advance Booking Charter. ; n\t(historical, basketball) Initialism of Asian Basketball Confederation. ; n\t(historical, bowling) Initialism of American Bowling Congress. ; n\tInitialism of Santo André, São Bernardo do Campo and São Caetano do Sul: satellite cities around the city of São Paulo that form the most important industrial area in Brazil. ; n\t(US, rail transport) Initialism of Atlanta, Birmingham and Coast Railroad. [The capital city, the county seat of Fulton County, Georgia, United States.] ; n\tInitialism of American Book Center: an English-language bookstore in Amsterdam founded in 1972. ; n\t(Christianity) Initialism of Anglican Book Centre: the publishing house and bookshop of the Anglican Church of Canada until 2013. ; adj\t(weaponry) Initialism of atomic, biological and chemical: the three main categories of weapon of mass destruction. [(physics, chemistry) Of or relating to atoms; composed of atoms; monatomic.] ; adj\t(slang, of a piece of chewing gum) Initialism of already been chewed. ; adj\t(medicine, of diffuse large B-cell lymphoma) Initialism of activated B-cell-like. "},{"w":"abcs","c":"1","s":"3","d":"n\t(US, usually plural only, countable) The alphabet. ; n\t(obsolete, poetry) A type of poem in which the lines start with the letters of the alphabet in order. ; n\t(plural only) Letters; writing; the skill of literacy. ; n\tThe alphabet, especially the English alphabet. ; n\tThe callsign for the Ceduna station of the Australian Broadcasting Corporation "},{"w":"abdicated","c":"1","s":"4","d":"adj\tCapable of being abdicated. "},{"w":"abdication","c":"1","s":"4","d":"n\t(obsolete) The act of disowning or disinheriting a child. ; n\tThe act of abdicating; the renunciation of a high office, dignity, or trust, by its holder. ; n\tThe voluntary renunciation of sovereign power. ; n\t(obsolete, law) The renunciation of interest in a property or a legal claim; abandonment. ; n\t(obsolete) The action of being deposed from the seat of power. "},{"w":"abdominal","c":"1","s":"4","d":"adj\tOf or pertaining to the abdomen; ventral. ; adj\t(ichthyology) Having the ventral fins under the abdomen and behind the pectoral fins. ; adj\t(ichthyology) Ventral, in describing a fin. ; adj\t(zoology, obsolete) Belonging to the order Abdominales of fish. ; n\t(zoology, obsolete) A fish of the order Abdominales. ; n\t(colloquial, usually plural only) An abdominal muscle. "},{"w":"abdominally","c":"1","s":"5","d":"adv\tIn the area of the abdomen. "},{"w":"abdominous","c":"1","s":"4","d":"adj\tHaving a protuberant belly; potbellied. "},{"w":"abducent","c":"1","s":"3","d":"adj\t(obsolete) Drawing away from the median axis of the body, as a muscle; see etymology abducting. ; n\tThat which abducts. ; n\t(neuroanatomy) An abducens nerve. "},{"w":"abducted","c":"1","s":"3","d":"adj\tHaving been kidnapped; having become the victim of an abduction "},{"w":"abductor","c":"1","s":"3","d":"n\tOne who abducts; a kidnapper. ; n\t(anatomy) A muscle which serves to draw a part out, or from the median line of the body "},{"w":"abdul","c":"1","s":"2","d":"n\tA male given name from Arabic used by Muslims. "},{"w":"abe","c":"1","s":"1","d":"n\tA diminutive of the male given name Abraham, from Hebrew. ; n\t(slang, US) A five-dollar bill. ; n\tA surname from Japanese. ; v\t(intransitive, infinitive, Britain, uncommon) To be. ; n\t(humorous, especially Ireland, Scotland and Wales) Initialism of anyone but England: any team playing a sports match against the England team. "},{"w":"abeam","c":"1","s":"2","d":"adv\t(nautical, aircraft) On the beam; at a right angle to the centerline or keel of a vessel or aircraft; being at a bearing approximately 090 Degrees or 270 Degrees relative. ; adv\t(nautical, aircraft) Alongside or abreast; opposite the center of the side of the ship or aircraft. ; adj\t(nautical, aircraft) Alongside or abreast; opposite the center of the side of the ship or aircraft. ; adj\tBeaming, shining (especially with reference to a person\u0027s face or eyes). "},{"w":"abecedarian","c":"1","s":"6","d":"n\tSomeone who is learning the alphabet. ; n\tAn elementary student, a novice; one in the early steps of learning. ; n\t(archaic) Someone engaged in teaching the alphabet; an elementary teacher; one that teaches the methods and principles of learning. ; n\t(rhetoric) A work which uses words or lines in alphabetical order. ; adj\t(now rare) Pertaining to someone learning the alphabet or basic studies; elementary; rudimentary. ; adj\tPertaining to the alphabet, or several alphabets. ; adj\tArranged in an alphabetical manner. ; adj\tRelating to or resembling an abecedarius. ; n\t(historical) A member of a 16th-century Anabaptist sect, follower of the Zwickau prophets (and specially of Thomas Storch), who believed that any kind of knowledge (even basic reading and writing) would keep one from reaching obtaining salvation. "},{"w":"abecedary","c":"1","s":"5","d":"n\t(rare) The alphabet, written out in a teaching book, or carved on a wall; a primer; abecedarium. ; n\tOne that teaches or learns the alphabet or the fundamentals of any subject; abecedarian. ; adj\tReferring to the alphabet; alphabetical; related to or resembling an abecedarius; abecedarian. "},{"w":"abed","c":"1","s":"2","d":"adv\tIn bed, or on the bed; confined to bed. ; adv\tTo childbed ; n\tA male given name from Arabic ; n\tA surname. "},{"w":"abel","c":"1","s":"2","d":"n\t(biblical) The son of Adam and Eve who was killed by his brother Cain. ; n\tA male given name from Hebrew. ; n\tA surname originating as a patronymic. "},{"w":"abele","c":"1","s":"2","d":"n\tThe white poplar (Populus alba). "},{"w":"abelia","c":"1","s":"3","d":"n\tAny of the various honeysuckles of the genus Abelia. "},{"w":"abend","c":"1","s":"2","d":"n\t(computing) The abnormal termination of a program. ; n\t(IEEE) Termination of a process prior to completion. ; v\t(computing) To terminate abnormally. ; n\tA surname from German. ; n\tAlternative spelling of abend [(computing) The abnormal termination of a program.] ; adj\tAcronym of absent by enforced net deprivation. "},{"w":"aber","c":"1","s":"2","d":"n\tA hamlet in Llanwenog, Ceredigion, Wales ; n\tA hamlet in Talybont-on-Usk, Powys, Wales ; n\tA suburb of Caerphilly, Caerphilly county borough, Wales ; n\t(local slang) Clipping of Aberystwyth. [A coastal town and community with a town council in Ceredigion, Wales (OS grid ref SN5881).] ; n\t(local slang) Clipping of Abergwyngregyn. "},{"w":"aberdeen","c":"1","s":"3","d":"n\tA port city in Aberdeen council area, Scotland, on the North Sea. ; n\tA council area of Scotland including the city, one of 32 created in 1996. ; n\tA former county in northeastern Scotland; see Aberdeenshire. ; n\tA locality in Monroe County, Arkansas. ; n\tAn unincorporated community in Inyo County, California. ; n\tA census-designated place in Florida. ; n\tA village in Georgia, United States. ; n\tA city in Idaho. ; n\tAn unincorporated community in Ohio County, Indiana. ; n\tA census-designated place in Porter County, Indiana. ; n\tAn unincorporated community in Butler County, Kentucky. ; n\tA city in eastern Maryland, home of the Aberdeen Proving Grounds. ; n\tA city, the county seat of Monroe County, Mississippi. ; n\tA town in North Carolina. ; n\tA village in Ohio. ; n\tA city, the county seat of Brown County, in northeastern South Dakota, United States. ; n\tA city in Washington. ; n\tAn unincorporated community in Lewis County, West Virginia. ; n\tA community in Nova Scotia. ; n\tA community in Ontario. ; n\tA town in Saskatchewan. ; n\tA town in Eastern Cape province, South Africa. ; n\tA town in New South Wales. ; n\tA suburb of Devonport, in northern Tasmania, Australia. ; n\tAn area and town in the Southern District, Hong Kong. ; n\t(usually capitalized) A wide evenly curved fishhook. ; n\t(usually capitalized) Alternative form of Aberdeen terrier [A breed of dog; Scottish terrier.] "},{"w":"aberrance","c":"1","s":"3","d":"n\tState of being aberrant; a wandering from the right way; deviation from truth, rectitude. "},{"w":"aberrantly","c":"1","s":"4","d":"adv\tIn an aberrant manner; abnormally. "},{"w":"aberrate","c":"1","s":"3","d":"v\t(intransitive) To go astray; to diverge; to deviate (from); deviate from. ; v\t(transitive) To distort; to cause aberration of. "},{"w":"abetment","c":"1","s":"3","d":"n\t(chiefly law) The act of abetting or assisting in a crime, wrongdoing etc. ; n\tEncouragement or assistance. "},{"w":"abetted","c":"1","s":"3","d":"v\t(obsolete, transitive) To urge on, stimulate (a person to do) something desirable. ; v\t(transitive) To incite; to assist or encourage by aid or countenance in crime. ; v\t(transitive, archaic) To support, countenance, maintain, uphold, or aid (any good cause, opinion, or action); to maintain. ; v\t(obsolete) To back up one\u0027s forecast of a doubtful issue, by staking money, etc., to bet. ; n\t(obsolete) Fraud or cunning. ; n\t(obsolete) An act of abetting; of helping; of giving aid. "},{"w":"abetting","c":"1","s":"3","d":"n\tThe act of one who abets. "},{"w":"abettor","c":"1","s":"3","d":"n\tOne that abets an offender; one that incites; instigates; encourages. ; n\tA supporter or advocate. "},{"w":"abeyant","c":"1","s":"3","d":"adj\tBeing in a state of abeyance; suspended. "},{"w":"abhorrence","c":"1","s":"3","d":"n\tExtreme aversion or detestation; the feeling of utter dislike or loathing. ; n\t(obsolete, historical) An expression of abhorrence, in particular any of the parliamentary addresses dictated towards Charles II. ; n\tA person or thing that is loathsome; a detested thing. "},{"w":"abhorring","c":"1","s":"3","d":"n\tDetestation. ; n\tA detested thing. "},{"w":"abidance","c":"1","s":"3","d":"n\tThe act of abiding or continuing; abode; stay; continuance; dwelling. ; n\tAdherence; compliance; conformity. "},{"w":"abides","c":"1","s":"2","d":"v\t(transitive) To endure without yielding; to withstand. ; v\t(transitive) To bear patiently. ; v\t(transitive) To pay for; to stand the consequences of. ; v\tUsed in a phrasal verb: abide by (“to accept and act in accordance with”). ; v\t(intransitive, obsolete) To wait in expectation. ; v\t(intransitive, obsolete) To pause; to delay. ; v\t(intransitive, archaic, Scotland) To stay; to continue in a place; to remain stable or fixed in some state or condition; to be left. ; v\t(intransitive, archaic) To have one\u0027s abode. ; v\t(intransitive, archaic) To endure; to remain; to last. ; v\t(transitive, archaic) To stand ready for; to await for someone; watch for. ; v\t(transitive, obsolete) To endure or undergo a hard trial or a task; to stand up under. ; v\t(transitive, archaic) To await submissively; accept without question; submit to. "},{"w":"abies","c":"1","s":"2","d":"n\tA tree of the genus Abies. ; n\tA tannin made from the barks of firs and spruces. "},{"w":"abigail","c":"1","s":"3","d":"n\t(obsolete) A lady\u0027s maid. ; n\tThe wife of Nabal and later of David in the Old Testament. ; n\tA female given name from Hebrew, used since the 16th century, and currently quite popular. "},{"w":"abilene","c":"1","s":"3","d":"n\t(biblical) A region of Syria south and southeast of Damascus. ; n\tA city, the county seat of Taylor County, in west-central Texas, west-southwest of Fort Worth; founded in 1881 with the coming of the railroad, the city first prospered as a shipping center for cattle. ; n\tA city, the county seat of Dickinson County, Kansas. ; adj\t(archaeology) Belonging to a prehistoric culture of central Texas, characterized by oval grinding stones. "},{"w":"abilities","c":"1","s":"4","d":"n\t(obsolete) Suitableness. ; n\t(uncountable) The quality or state of being able; capacity to do or of doing something; having the necessary power. ; n\tThe legal wherewithal to act. ; n\t(now limited to Scotland dialects) Physical power. ; n\t(archaic) Financial ability. ; n\t(uncountable) A unique power of the mind; a faculty. ; n\t(countable) A skill or competence in doing; mental power; talent; aptitude. "},{"w":"abiotic","c":"1","s":"4","d":"adj\tNonliving, inanimate, characterised by the absence of life; of inorganic matter. ; adj\tTending to inhibit or destroy life; antibiotic; incompatible with life. ; n\tAny such material "},{"w":"abit","c":"1","s":"2","d":"adv\t(nonstandard, proscribed) Alternative form of a bit. [(informal) To a small extent; in a small amount.] "},{"w":"abjection","c":"1","s":"3","d":"n\tA low or downcast condition; meanness of spirit; abasement; degradation. ; n\t(obsolete, chiefly figuratively) Something cast off; garbage. ; n\t(obsolete) The act of bringing down or humbling; casting down. ; n\t(obsolete) The act of casting off; rejection. ; n\t(biology, mycology) The act of dispersing or casting off spores. "},{"w":"abjugate","c":"1","s":"3","d":"v\t(obsolete, transitive) To unyoke; set free; uncouple. "},{"w":"abjured","c":"1","s":"2","d":"adj\tHaving been renounced, forsworn or rejected. "},{"w":"ablactate","c":"1","s":"3","d":"v\t(rare) To wean. "},{"w":"ablaut","c":"1","s":"2","d":"n\t(phonology) The substitution of one root vowel for another, thus indicating a corresponding modification of use or meaning; vowel permutation, distinct from the phonetic influence of a succeeding vowel. ; v\t(intransitive, linguistics, of a vowel-containing linguistic component) To undergo a change of vowel. ; v\t(transitive, linguistics) To cause to change a vowel. "},{"w":"ablaze","c":"1","s":"2","d":"adj\tBurning fiercely; in a blaze; on fire. ; adj\tRadiant with bright light and color. ; adj\tIn a state of glowing excitement, ardent desire, or other strong emotion. ; adv\tOn fire; in a blaze. ; adv\tLit up brightly and with color, gleaming. ; adv\tIn a state of glowing excitement or ardent desire. "},{"w":"ableism","c":"1","s":"4","d":"n\tDiscrimination against persons with disabilities or favour of those without. "},{"w":"ablest","c":"1","s":"2","d":"adj\tHaving the necessary powers or the needed resources to accomplish a task. ; adj\tFree from constraints preventing completion of task; permitted to; not prevented from. ; adj\tGifted with skill, intelligence, knowledge, or competence. ; adj\t(law) Legally qualified or competent. ; adj\t(nautical) Capable of performing all the requisite duties; as an able seaman. ; adj\t(obsolete, dialectal) Having the physical strength; robust; healthy. ; adj\t(obsolete) Easy to use. ; adj\t(obsolete) Suitable; competent. ; adj\t(obsolete, dialectal) Liable to. ; adj\t(obsolete) Rich; well-to-do. ; v\t(transitive, obsolete) To make ready. ; v\t(transitive, obsolete) To make capable; to enable. ; v\t(transitive, obsolete) To dress. ; v\t(transitive, obsolete) To give power to; to reinforce; to confirm. ; v\t(transitive, obsolete) To vouch for; to guarantee. ; n\t(military) The letter \"A\" in Navy Phonetic Alphabet. ; n\tA surname. "},{"w":"abloom","c":"1","s":"2","d":"adv\t(postpositive) In or into bloom; in a blooming state; having flower blooms unfolding. ; adj\tBlooming; covered in flowers. ; adj\t(figuratively) Having something growing or grown. ; adj\tThriving in health, beauty, and vigor; exhibiting youth-like beauty. "},{"w":"abluent","c":"1","s":"3","d":"adj\t(pharmacology) Washing away; carrying off impurities; detergent. ; n\t(pharmacology) A detergent. "},{"w":"ablutions","c":"1","s":"3","d":"n\tA building that houses bathing and toilet facilities on a military base. ; n\t(plural only, UK, military) The location or building where the showers and basins are located. "},{"w":"ably","c":"1","s":"2","d":"adv\tIn an able manner; with great ability. "},{"w":"abnormality","c":"1","s":"5","d":"n\tThe state or quality of being abnormal; variation; irregularity. ; n\tSomething abnormal; an aberration; an abnormal occurrence or feature. "},{"w":"abo","c":"1","s":"2","d":"n\t(Australia, offensive, ethnic slur, slang) An aborigine; aboriginal. ; n\t(medicine) The most important blood type classification system for human blood transfusions. ; n\tAlternative letter-case form of abo [(Australia, offensive, ethnic slur, slang) An aborigine; aboriginal.] "},{"w":"aboding","c":"1","s":"3","d":"n\t(obsolete) A foreboding. "},{"w":"abolition","c":"1","s":"4","d":"n\tThe act of abolishing; an annulling; abrogation. ; n\tThe state of being abolished. ; n\t(historical, often capitalised, UK, US) The ending of the slave trade or of slavery. ; n\t(historical, often capitalised, Australia) The ending of convict transportation. ; n\t(obsolete) An amnesty; a putting out of memory. "},{"w":"abolitionist","c":"1","s":"5","d":"adj\t(historical) In favor of the abolition of slavery. ; n\tA person who favors the abolition of any particular institution or practice. ; n\t(historical, US) A person who favored or advocated the abolition of slavery. "},{"w":"abominate","c":"1","s":"4","d":"adj\t(rare) Abominable; detested. ; v\t(transitive) To feel disgust towards; to loathe or detest thoroughly; to hate in the highest degree, as if with religious dread. ; v\t(transitive, colloquial) To dislike strongly. "},{"w":"aboral","c":"1","s":"3","d":"adj\t(zoology) Situated opposite to, or away from, the mouth. "},{"w":"aborigine","c":"1","s":"5","d":"n\t(offensive) An Aboriginal person from Australia (descending from, or a member of, one of the indigenous people(s) before British colonization), Aboriginal Australian. ; n\tA native inhabitant of a country; a member of the original people. ; n\t(in the plural) The native flora and fauna of an area. "},{"w":"aborigines","c":"1","s":"5","d":"n\toriginal inhabitants, natives. ; n\t(Roman mythology) The earliest inhabitants of central Italy, from whom the Latins were said to have descended. ; n\tThe native peoples of various regions, especially the Australian Aboriginal peoples, but also the original inhabitants of Canada and Argentina. Often considered offensive. ; n\tThe original people of a location, originally Greek and Roman. ; n\tIndigenous flora and fauna. ; n\t(historical) The inhabitants of a location before colonization by the Europeans occurred. "},{"w":"aborning","c":"1","s":"3","d":"adv\t(chiefly Canada, US) That is in the process of being born; coming into existence; before coming to completion. ; adj\t(chiefly Canada, US) While being born or produced. "},{"w":"abortive","c":"1","s":"3","d":"adj\t(obsolete) Produced by abortion; born prematurely and therefore unnatural. ; adj\tComing to nothing; failing in its effect. . ; adj\t(biology) Imperfectly formed or developed; rudimentary; sterile. ; adj\t(pharmacology, medicine, rare, attributive) Causing abortion; abortifacient ; adj\t(medicine) Cutting short; acting to halt or slow the progress (of a disease). ; adj\tMade from the skin of a still-born animal. ; n\t(obsolete) Someone or something born or brought forth prematurely; an abortion. ; n\t(obsolete) A fruitless effort. ; n\t(obsolete) A medicine to which is attributed the property of causing abortion, abortifacient. ; v\t(transitive, obsolete) To cause an abortion; to render without fruit. "},{"w":"abounding","c":"1","s":"3","d":"adj\tAmple, plenty, abundant. ; n\tAn abundance. "},{"w":"about-face","c":"1","s":"3","d":"n\t(military) An abrupt turn to face the opposite direction. ; n\tA reversal in direction; a reversal of attitude or opinion. ; v\t(intransitive) To turn 180 degrees to face the opposite direction. ; v\tTo change opinion or attitude drastically. "},{"w":"aboveboard","c":"1","s":"3","d":"adj\tAlternative form of above-board [In open sight; without trick, concealment, or deception.] "},{"w":"aboveground","c":"1","s":"3","d":"adj\tAlternative spelling of above ground "},{"w":"abovementioned","c":"1","s":"4","d":"adj\t(literary) mentioned above "},{"w":"above-mentioned","c":"1","s":"4","d":"adj\tMentioned or named before; aforesaid. "},{"w":"abracadabra","c":"1","s":"5","d":"n\tA use of the mystical term ‘abracadabra’, supposed to work as part of a healing charm or a magical spell; any spell or incantation making use of the word. ; n\tMumbo-jumbo; obscure language or technicalities; jargon. "},{"w":"abradant","c":"1","s":"3","d":"n\tA material used for grinding, as emery, sand, powdered glass, etc.; an abrasive. ; adj\tTending to abrade; causing irritation; abrasive. "},{"w":"abraded","c":"1","s":"3","d":"adj\thaving the skin scraped off"},{"w":"abraham","c":"1","s":"3","d":"n\t(Judaism, Christianity, Islam, Baha\u0027i) A prophet in the Old Testament, Qur\u0027an and Aqdas; a Semitic patriarch who preached monotheism, father of the Jewish patriarch Isaac and the Arab patriarch Ishmael. ; n\tA male given name from Hebrew. ; n\tA surname originating as a patronymic. ; n\tThe 14th sura (chapter) of the Qur\u0027an. ; n\t(archaic, British slang, chiefly London) A shop selling cheap and low-quality clothes, especially in the East End of London. "},{"w":"abraid","c":"1","s":"2","d":"v\t(transitive, obsolete) To wrench (something) out. ; v\t(intransitive, obsolete) To wake up. ; v\t(intransitive, archaic) To spring, start, make a sudden movement. ; v\t(intransitive, transitive, obsolete) To shout out. ; v\t(transitive, obsolete) To rise in the stomach with nausea. ; adv\tAlternative form of abread [(UK dialectal, chiefly Scotland) Abroad.] "},{"w":"abrasiveness","c":"1","s":"4","d":"n\tThe property, quality or instance of being abrasive. "},{"w":"abreaction","c":"1","s":"4","d":"n\t(psychoanalysis) The re-living of an experience with a view to purging its emotional dross. "},{"w":"abri","c":"1","s":"2","d":"n\ta shelter; a cavity in a hillside; a shelter on the side of hill with an overhung rock as its roof "},{"w":"abridgement","c":"1","s":"3","d":"n\t(chiefly UK) Alternative form of abridgment [(US) The act of abridging; reduction or deprivation] "},{"w":"abroach","c":"1","s":"2","d":"v\t(transitive, obsolete) To set abroach; to let out, as liquor; to broach; to tap. ; adv\t(obsolete) Broached; in a condition for letting out or yielding liquor, as a cask which is tapped. ; adv\t(obsolete) In a state to be diffused or propagated. ; adj\tTapped; broached. ; adj\tAstir; moving about. "},{"w":"abrogated","c":"1","s":"4","d":"v\t(transitive, law) To annul by an authoritative act; to abolish by the authority of the maker or her or his successor; to repeal; — applied to the repeal of laws, decrees, ordinances, the abolition of customs, etc. ; v\t(transitive) To put an end to; to do away with. ; v\t(molecular biology, transitive) To block a process or function. ; adj\t(archaic) Abrogated; abolished. "},{"w":"abrogating","c":"1","s":"4","d":"v\t(transitive, law) To annul by an authoritative act; to abolish by the authority of the maker or her or his successor; to repeal; — applied to the repeal of laws, decrees, ordinances, the abolition of customs, etc. ; v\t(transitive) To put an end to; to do away with. ; v\t(molecular biology, transitive) To block a process or function. ; adj\t(archaic) Abrogated; abolished. "},{"w":"abrogation","c":"1","s":"4","d":"n\tThe act of abrogating; a repeal by authority; abolition. "},{"w":"absalom","c":"1","s":"3","d":"n\tThe third son of David, king of Israel. ; n\t(rare) A male given name from Hebrew. "},{"w":"abscind","c":"1","s":"2","d":"v\t(transitive, archaic) To cut off. "},{"w":"abscise","c":"1","s":"2","d":"v\t(transitive) To cut off. ; v\t(intransitive, botany) To separate by means of abscission; to shed or drop off. "},{"w":"abscission","c":"1","s":"3","d":"n\tThe act or process of cutting off. ; n\t(obsolete) The state of being cut off. ; n\t(rhetoric) A figure of speech employed when a speaker having begun to say a thing stops abruptly ; n\t(botany) The natural separation of a part at a predetermined location, such as a leaf at the base of the petiole. "},{"w":"absconce","c":"1","s":"2","d":"n\tA dark lantern used in church to read prayers etc during a service. "},{"w":"absconded","c":"1","s":"3","d":"v\t(law) To hide, conceal, or absent oneself clandestinely, with the intent to avoid legal process ; v\t(intransitive, of bee colonies) To abandon a hive. ; v\t(intransitive) To hide, to be in hiding or concealment. ; v\t(intransitive, uncommon) To withdraw. ; v\t(transitive, uncommon) To evade, to hide or flee from. ; v\t(obsolete, transitive) To conceal; to take away. "},{"w":"absconder","c":"1","s":"3","d":"n\tA person who absconds. "},{"w":"absconding","c":"1","s":"3","d":"n\tAn instance in which someone absconds. "},{"w":"abseiling","c":"1","s":"3","d":"n\tThe process or act of abseiling. "},{"w":"absentee","c":"1","s":"3","d":"n\tA person who is absent from his or her employment, school, post, duty, etc. ; n\t(chiefly Britain, historical) A landholder who lives in another district or country than the one in which his estate is situated. ; n\tOne that is nonexistent or lacking. ; n\tA voter that is not present at the time of voting; absentee voter. ; adj\t(attributive) Pertaining to one that is absent. "},{"w":"absenteeism","c":"1","s":"5","d":"n\tThe state of being absent, especially frequently or without good reason; the practice of an absentee. ; n\tThe practice of absenting oneself from the country or district where one\u0027s estate is situated. "},{"w":"absentia","c":"1","s":"3","d":"n\tabsence "},{"w":"absentminded","c":"1","s":"4","d":"adj\tAlternative form of absent-minded [Absent in mind; often preoccupied; forgetful or careless due to distraction; easily distracted.] "},{"w":"absent-minded","c":"1","s":"4","d":"adj\tAbsent in mind; often preoccupied; forgetful or careless due to distraction; easily distracted. "},{"w":"absents","c":"1","s":"2","d":"adj\t(not comparable) Being away from a place; withdrawn from a place; not present; missing. ; adj\t(not comparable) Not existing; lacking. ; adj\t(comparable) Inattentive to what is passing; absent-minded; preoccupied. ; n\t(with definite article) Something absent, especially absent people collectively; those who were or are not there. ; n\t(obsolete, Scotland) An absentee; a person who is not there. ; v\t(reflexive) To keep (oneself) away. ; v\t(transitive, archaic) To keep (someone) away. ; v\t(intransitive, obsolete) Stay away; withdraw. ; v\t(transitive, rare) Leave. "},{"w":"absinth","c":"1","s":"2","d":"n\tAlternative form of absinthe [The herb absinthium Artemisia absinthium (grande wormwood); essence of wormwood.] "},{"w":"absolutism","c":"1","s":"5","d":"n\t(theology) Doctrine of preordination; doctrine of absolute decrees; doctrine that God acts in an absolute manner. ; n\t(political science, sociology) The principles or practice of absolute or arbitrary government; despotism. ; n\t(philosophy) Belief in a metaphysical absolute; belief in Absolute. ; n\tPositiveness; the state of being absolute. ; n\t(rare) The characteristic of being absolute in nature or scope; absoluteness. "},{"w":"absolutist","c":"1","s":"4","d":"n\tOne who is in favor of an absolute or autocratic government. ; n\t(metaphysics) One who believes that it is possible to realize a cognition or concept of the Absolute. ; n\tAn uncompromising person; one who maintains certain principles to be absolute. ; adj\tOf or pertaining to absolutism; arbitrary; despotic; uncompromising. "},{"w":"absolved","c":"1","s":"2","d":"adj\tfreed from any question of guilt"},{"w":"absorbed","c":"1","s":"2","d":"adj\tFully occupied with one\u0027s thoughts; engrossed. ; adj\tSomething that has been absorbed, taken in, engulfed, imbibed, or assimilated. "},{"w":"absorbing","c":"1","s":"3","d":"adj\tEngrossing, that sustains someone\u0027s interest. ; adj\t(statistics, of a state) Allowing a process to enter it, but not to leave it. "},{"w":"absorptive","c":"1","s":"3","d":"adj\tHaving power, capacity, or tendency to absorb or imbibe; absorbent. ; n\tAny substance that absorbs. "},{"w":"absquatulate","c":"1","s":"4","d":"v\t(intransitive, slang) To leave quickly or in a hurry; to depart, flee. ; v\t(intransitive, slang) to abscond. "},{"w":"abstention","c":"1","s":"3","d":"n\t(obsolete) The act of restraining oneself. ; n\tThe act of abstaining or refraining (from). ; n\tThe act of declining to vote on a particular issue. ; n\tNon-participation in the political world; as a country avoiding international affairs. "},{"w":"absterge","c":"1","s":"2","d":"v\t(transitive, archaic, now rare) To make clean by wiping; to wipe away. "},{"w":"abstinent","c":"1","s":"3","d":"adj\tRefraining from indulgence, especially from the indulgence of appetite. ; n\tOne who abstains; a faster. ; n\t(usually capitalized, religion, historical) One of a sect who appeared in France and Spain in the 3rd century, and believed in abstinence from meat and sex. ; n\t(religion, historical) One of a religious sect that appeared in France and Spain in the 3rd century, and practised abstinence from meat and sex. "},{"w":"abstracted","c":"1","s":"3","d":"adj\tSeparated or disconnected; withdrawn; removed; apart. ; adj\t(now rare) Separated from matter; abstract; ideal, not concrete. ; adj\t(now rare) Abstract; abstruse; difficult. ; adj\tInattentive to surrounding objects; absent in mind; meditative. "},{"w":"abstractly","c":"1","s":"3","d":"adv\tIn an abstract way or manner ; adv\tseparately; absolutely "},{"w":"absurdist","c":"1","s":"3","d":"n\tAn advocate of absurdism, in particular a writer of absurd topics. ; adj\tOf, or relating to absurdism. "},{"w":"absurdity","c":"1","s":"4","d":"n\t(countable) That which is absurd; an absurd action; a logical contradiction. ; n\t(uncountable) The quality of being absurd or inconsistent with obvious truth, reason, or sound judgment. ; n\t(obsolete, rare) Dissonance. "},{"w":"abu","c":"1","s":"2","d":"n\tA language of Papua New Guinea. ; n\tAb, the fifth month of the Babylonian calendar. ; n\t(mythology) A minor god of vegetation in Sumerian mythology. ; n\tThe ancient Egyptian name for the city of Elephantine, near modern day Aswan. ; n\tA volcano on the island of Honshū in Japan. ; n\tAbu, Yamaguchi, a town in Japan. ; n\tMount Abu, the highest mountain in the Indian state of Rajasthan. ; n\t(UK, soccer, slang) Initialism of anyone but United: a fan who dislikes Manchester United and will support any team that is playing against them. "},{"w":"abuja","c":"1","s":"3","d":"n\tThe capital city of Nigeria; lying in the Federal Capital Territory in the North Central geopolitical zone. "},{"w":"abulia","c":"1","s":"4","d":"n\t(psychiatry) Absence of willpower or decisiveness, especially as a symptom of mental illness. "},{"w":"abundantly","c":"1","s":"4","d":"adv\tIn an abundant manner; in a sufficient degree; in large measure. ; adv\tExtremely. "},{"w":"abused","c":"1","s":"2","d":"adj\tHaving been a victim of some form of abuse, most commonly child abuse or domestic violence. ; adj\tOverused; used profligately or in excess. ; adj\t(obsolete) Deluded, deceived. "},{"w":"abusion","c":"1","s":"3","d":"n\t(obsolete) Misuse, abuse. ; n\t(obsolete) Abuse of the truth; deceit, lying. ; n\t(obsolete) Violation of law or propriety; outrage, improper behaviour. ; n\t(obsolete) Catachresis. ; n\t(obsolete) Physical, mental, verbal, or sexual abuse. "},{"w":"abusive","c":"1","s":"3","d":"adj\tProne to treat someone badly by coarse, insulting words or other maltreatment; vituperative; reproachful; scurrilous. ; adj\t(obsolete) Tending to deceive; fraudulent. ; adj\t(archaic) Tending to misuse; practising or containing abuse. ; adj\tBeing physically or emotionally injurious; characterized by repeated violence or other abuse. ; adj\tWrongly used; perverted; misapplied; unjust; illegal. ; adj\t(archaic) Catachrestic. "},{"w":"abuts","c":"1","s":"2","d":"v\t(intransitive) To touch by means of a mutual border, edge or end; to border on; to lie adjacent (to); to be contiguous (said of an area of land) ; v\t(transitive) To border upon; be next to; abut on; be adjacent to. ; v\t(intransitive) To lean against on one end; to end on, of a part of a building or wall. "},{"w":"abuttal","c":"1","s":"3","d":"n\t(rare, plural only) The butting or boundary of land, particularly at the end; buttals. ; n\tAn abutment. ; n\tThe act of abutting. ; v\t(transitive) To describe a piece of land in terms of its abuttals. "},{"w":"abutting","c":"1","s":"3","d":"adj\tFacing each other, front to front. ; n\tabutment "},{"w":"abuzz","c":"1","s":"2","d":"adj\t(postpositive) Characterized by a high level of activity or gossip; in a buzz (“feeling or rush of energy or excitement”), buzzing. "},{"w":"aby","c":"1","s":"2","d":"v\t(archaic) To pay the penalty for (something); to atone for, to make amends. ; v\t(archaic, figuratively) To pay (something) as a penalty; to suffer (something). ; v\t(obsolete except Scotland) To endure or tolerate (something); to experience. ; v\t(obsolete) To pay for (something); to buy. ; v\tTo pay the penalty; to atone. ; v\tTo endure; to remain. ; n\tA village in Aby with Greenfield parish, East Lindsey district, Lincolnshire, England (OS grid ref TL4178). ; n\tA village in south-eastern Ivory Coast. "},{"w":"abysm","c":"1","s":"2","d":"n\t(archaic, poetic) Hell; the infernal pit; the great deep; the primal chaos. ; n\t(now chiefly literary) An abyss; a gulf, a chasm, a very deep hole. "},{"w":"abyssal","c":"1","s":"3","d":"adj\t(archaic) Belonging to, or resembling, an abyss; unfathomable. ; adj\t(geography) Of or belonging to the ocean depths, especially below 2000 metres (6500 ft): abyssal zone. ; adj\t(geology) Pertaining to or occurring at excessive depths in the earth\u0027s crust; plutonic. "},{"w":"abyssinia","c":"1","s":"4","d":"n\t(historical) Ethiopian Empire (Ethiopia and Eritrea). ; adj\t(dated) Ethiopian; Eritrean; Abyssinian. "}]
