[{"word":"arise","score":36368,"numSyllables":2,"defs":["v\tTo come up from a lower to a higher position. ","v\tTo come up from one's bed or place of repose; to get up. ","v\tTo spring up; to come into action, being, or notice; to become operative, sensible, or visible; to begin to act a part; to present itself. ","n\t(obsolete) Arising, rising. "]},{"word":"awake","score":9768,"numSyllables":2,"defs":["adj\tNot asleep; conscious. ","adj\t(figuratively, by extension) Alert, aware. ","v\t(intransitive) To become conscious after having slept. ","v\t(transitive) To cause (somebody) to stop sleeping. ","v\t(transitive) To make aware of something. ","v\t(transitive) To excite or to stir up something latent. ","v\t(transitive, figuratively) To rouse from a state of inaction or dormancy. ","v\t(intransitive, figuratively) To come out of a state of inaction or dormancy. "]},{"word":"away","score":9014,"numSyllables":2,"defs":["adv\tFrom a place, hence. ","adv\tAside; off; in another direction. ","adv\tAside, so as to discard something. ","adv\tAt a stated distance in time or space. ","adv\tIn or to something's usual or proper storage place. ","adv\tIn or to a secure or out-of-the-way place. ","adv\tFrom a state or condition of being; out of existence. ","adv\tSo as to remove or use up something. ","adv\t(as imperative, by ellipsis) Come away; go away; take away. ","adv\tOn; in continuance; without intermission or delay. ","adv\tWithout restraint. ","adj\tNot here, gone, absent, unavailable, traveling; on vacation. ","adj\tAt a specified distance in space, time, or figuratively. ","adj\t(chiefly sports) Not on one's home territory. ","adj\t(baseball, following the noun modified) Out. ","adj\t(golf) Being the player whose ball lies farthest from the hole (or, in disc golf, whose disc lies farthest from the target). ","v\t(intransitive, poetic) To depart; to go to another place. ","adj\tMisspelling of aweigh. [Just drawn out of the ground, and hanging perpendicularly; atrip; said of the anchor.] "]},{"word":"a","score":8332,"numSyllables":1,"defs":["n\tAce. (including in card games) ","n\tAcre. ","n\tAdult; as used in film rating. ","n\tAmmeter. ","n\t(physics) Angstrom. ","n\tAnswer. ","n\t(sports) An assist. ","n\t(sexuality) Asexual. ","n\t(UK, London) Arsehole. ","n\t(weaponry) Atom. ","adj\t(weaponry) Atom; atomic. ","n\tThe name of the Latin script letter A / a. ","v\t(archaic or slang) Have. ","adv\t(chiefly Scotland) All. ","adj\t(chiefly Scotland) All. ","adv\t(crosswords) across ","n\tThe name of the Cyrillic script letter А / а. ","adv\t(chiefly US) Alternative spelling of a.m. (“ante meridiem”) or am [Before noon.] "],"defHeadword":"A"},{"word":"acid","score":7872,"numSyllables":2,"defs":["adj\tSour, sharp, or biting to the taste; tart; having the taste of vinegar. ","adj\t(figuratively) Sour-tempered. ","adj\tOf or pertaining to an acid; acidic. ","adj\t(music) Denoting a musical genre that is a distortion (as if hallucinogenic) of an existing genre, as in acid house, acid jazz, acid rock. ","n\tA sour substance. ","n\tAny compound which yields H+ ions (protons) when dissolved in water; an Arrhenius acid. ","n\tAny compound that easily donates protons to a base; a Brønsted acid. ","n\tAny compound that can accept a pair of electrons to form a covalent bond; a Lewis acid. ","n\t(uncountable, slang) LSD, lysergic acid diethylamide. ","n\t(databases) Acronym of atomicity, consistency, isolation, and durability, a set of properties that guarantee database transactions are processed reliably. [(uncountable) The quality or state of being atomic.] "]},{"word":"apple","score":7840,"numSyllables":2,"defs":["n\tA common, round fruit produced by the tree Malus domestica, cultivated in temperate climates. ","n\tAny fruit or vegetable, or any other thing produced by a plant such as a gall or cone, especially if produced by a tree and similar to the fruit of Malus domestica; also (with qualifying words) used to form the names of specific fruits such as custard apple, rose apple, thorn apple etc. ","n\t(baseball, slang, obsolete) The ball in baseball. ","n\t(informal) When smiling, the round, fleshy part of the cheeks between the eyes and the corners of the mouth. ","n\tThe Adam's apple. ","n\t(Christianity) The fruit of the Tree of Knowledge, eaten by Adam and Eve according to post-Biblical Christian tradition; the forbidden fruit. ","n\tA tree of the genus Malus, especially one cultivated for its edible fruit; the apple tree. ","n\tThe wood of the apple tree. ","n\t(derogatory, ethnic slur) A Native American or red-skinned person who acts and/or thinks like a white (Caucasian) person. ","n\t(ice hockey, slang) An assist. ","n\t(slang) A CB radio enthusiast. ","v\t(transitive, intransitive) To make or become apple-like. ","v\t(obsolete) To form buds, bulbs, or fruit. ","n\t(with \"the\") A nickname for New York City, usually “the Big Apple”. ","n\tThe company Apple Inc., formerly Apple Computer, that produces computers and other digital devices, and sells and produces multimedia content. ","n\tA multimedia corporation (Apple Corps) and record company (Apple Records) founded by the Beatles. ","n\t(rare, countable) A female given name from English. ","n\t(countable) A surname. ","n\tA computer produced by the company Apple Inc. ","n\t(in the plural, Cockney rhyming slang) Short for apples and pears, slang for stairs. [(Cockney rhyming slang) stairs] "]},{"word":"around","score":6183,"numSyllables":2,"defs":["adj\t(informal, with the verb \"to be\") Present in the vicinity. ","adj\t(informal, with the verb \"to be\") Alive; existing. ","adv\tSo as to form a circle or trace a circular path, or approximation thereof. ","adv\tSo as to surround or be near. ","adv\tNearly; approximately; about. ","adv\tFrom place to place. ","adv\tFrom one state or condition to an opposite or very different one; with a metaphorical change in direction; bringing about awareness or agreement. ","adv\t(with turn, spin, etc.) So as to partially or completely rotate; so as to face in the opposite direction. ","adv\tUsed with verbs to indicate repeated or continuous action, or in numerous locations or with numerous people. ","adv\tUsed with certain verbs to suggest unproductive activity. "]},{"word":"account","score":4901,"numSyllables":2,"defs":["n\t(accounting) A registry of pecuniary transactions; a written or printed statement of business dealings or debts and credits, and also of other things subjected to a reckoning or review. ","n\t(banking) A bank account. ","n\tA statement in general of reasons, causes, grounds, etc., explanatory of some event; a reason of an action to be done. ","n\tA reason, grounds, consideration, motive; a person's sake. ","n\tA record of events; a relation or narrative. ","n\tAn estimate or estimation; valuation; judgment. ","n\tImportance; worth; value; esteem; judgement. ","n\tAuthorization as a specific registered user in accessing a system. ","n\t(archaic) A reckoning; computation; calculation; enumeration; a record of some reckoning. ","n\t(uncountable) Profit; advantage. ","v\t(obsolete, transitive) To present an account of; to answer for, to justify. ","v\t(intransitive, now rare) To give an account of financial transactions, money received etc. ","v\t(transitive) To estimate, consider (something to be as described). ","v\t(intransitive) To consider that. ","v\t(intransitive) To give a satisfactory evaluation for financial transactions, money received etc. ","v\t(intransitive) To give a satisfactory evaluation for (one's actions, behaviour etc.); to answer for. ","v\t(intransitive) To give a satisfactory reason for; to explain. ","v\t(intransitive) To establish the location for someone. ","v\t(intransitive) To cause the death, capture, or destruction of someone or something (+ for). ","v\t(transitive, now rare) To calculate, work out (especially with periods of time). ","v\t(obsolete) To count (up), enumerate. ","v\t(obsolete) To recount, relate (a narrative etc.). "]},{"word":"art","score":4728,"numSyllables":1,"defs":["n\t(uncountable) The conscious production or arrangement of sounds, colours, forms, movements, or other elements in a manner that affects the senses and emotions, usually specifically the production of the beautiful in a graphic or plastic medium. ","n\t(uncountable) The creative and emotional expression of mental imagery, such as visual, auditory, social, etc. ","n\t(countable) Skillful creative activity, usually with an aesthetic focus. ","n\t(uncountable) The study and the product of these processes. ","n\t(uncountable) Aesthetic value. ","n\t(uncountable) Artwork. ","n\t(countable) A field or category of art, such as painting, sculpture, music, ballet, or literature. ","n\t(countable) A nonscientific branch of learning; one of the liberal arts. ","n\t(countable) Skill that is attained by study, practice, or observation. ","n\t(uncountable, dated) Contrivance, scheming, manipulation. ","n\tA diminutive of the male given name Arthur, from the Celtic languages. ","n\tAbbreviation of assisted reproductive technology. [(medicine) Any technological means of inducing pregnancy, for example by artificial insemination.] ","n\tAbbreviation of Androgen Replacement Therapy. ","n\tAbbreviation of Active Release Technique. ","n\tAbbreviation of Adaptive resonance theory. ","n\tAbbreviation of Algebraic Reconstruction Technique. ","n\tAbbreviation of Alternative Risk Transfer. ","n\tAbbreviation of acoustic resonance technology. ","n\tAbbreviation of anti-retroviral therapy. "]},{"word":"access","score":3948,"numSyllables":2,"defs":["n\t(uncountable) A way or means of approaching or entering; an entrance; a passage. ","n\t(uncountable) The act of approaching or entering; an advance. ","n\t(uncountable) The right or ability of approaching or entering; admittance; admission; accessibility. ","n\t(uncountable) The quality of being easy to approach or enter. ","n\t(uncountable) Admission to sexual intercourse. ","n\t(archaic, countable) An increase by addition; accession ","n\t(countable) An onset, attack, or fit of disease; an ague fit. ","n\t(countable) An outburst of an emotion; a paroxysm; a fit of passion. ","n\t(uncountable, law) The right of a noncustodial parent to visit their child. ","n\t(countable, computing) The process of locating data in memory. ","n\t(uncountable, networking) Connection to or communication with a computer program or to the Internet. ","n\t(uncountable, Scotland) Complicity or assent. ","v\t(transitive) To gain or obtain access to. ","v\t(transitive, computing) To have access to (data). "]}]
